{
  "type": null,
  "faqId": 32121,
  "title": "Koji su uslovi garancije za P8 telefon?",
  "answer": "Želeli bismo ovim putem da vas obavestimo da smo za sve korisnike telefona Huawei P8 obezbedili dodatne pogodnosti. Ove pogodnosti ukljucuju sledeće:\r\n\r\n1.       Obezbeđena je dodatna ”***premium garancija***” za Huawei P8\r\n\r\n2.       Garantni period umesto standardnih 2 godine, za model telefona Huawei P8 je produžen na ***3 godine*** od prodaje krajnjem korisniku.\r\n\r\nDodatna “***premium garancija***” koju nudimo se zapravo odnosi na besplatno servisiranje uredjaja koji je oštećen od strane krajnjeg korisnika. Funkcioniše na taj način da je omogućeno korisniku da ošteti uređaj i da mu se kvar koji je nastao oštećenjem otkloni bez novcane nadoknade i ova besplatna usluga je omogućena samo jednom. Ukoliko korisnik ponovo ošteti uređaj nije moguce servisiranje u garanciji već se popravka smatra van garancije – kao i za sve ostale proizvode u nasoj ponudi.\r\n\r\nKorisniku, osim standardne garancije koju dobija prilikom kupovine telefona Huawei P8, ne treba nikakva dodatna garancija. Dovojno je da ima sa sobom uredno popunjenu osnovnu garanciju i račun.  \r\n\r\nPod oštećenjem se podrazumeva:\r\n\r\n- Mehaničko oštećenje (usled pada, uvijanja itd)\r\n\r\n- Oštećenje izazvano tečnošću (prodiranje tečnosti u unutrašnjost uređaja)\r\n\r\nNEOVLAŠĆENE SERVISNE AKTIVNOSTI NECE BITI POKRIVENE GARANCIJOM – to podrazumeva:\r\n\r\n1.       Upisivanje neovlašćenog Firmware-a koji nije potpisan od strane Huawei-a\r\n\r\n2.       Intervencije na uređaju od strane neovlašćenog servisera.\r\n\r\nNAPOMENA: Potpuno oštećeni uređaji ne podležu premium garanciji pošto je njihovo servisranje nemoguće. \r\n\r\nMolimo proverite tačne uslove garancije sa prodavcem",
  "faqTypeId": null,
  "faqType": null,
  "useful": 8,
  "unUseful": 0,
  "languageId": 106,
  "languageName": "rs",
  "faqCode": "6821",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1436357126000,
  "seriesProductName": "",
  "visitedTimes": 831,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}