{"type":null,"faqId":36110,"title":"How do I transfer files between my HUAWEI MediaPad and a computer running Windows?","answer":"<p>When you connect your HUAWEI MediaPad to a computer running Windows using a USB cable for the first time and you are prompted to install a driver, follow the onscreen instructions to install it. Flick down from the status bar of your HUAWEI MediaPad to open the notification panel and choose a connection mode. <br>\nThe following connection modes are available:&nbsp;<br>\n- &nbsp;Files: In this mode, you can access files saved to your HUAWEI MediaPad's internal storage and microSD card by opening the computer's new disk drive and transfer those files between your HUAWEI MediaPad and computer. You can also open media files saved to your HUAWEI MediaPad's internal storage and microSD card using Windows Media Player. <br>\n<img border=\"0\" src=\"http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150730170643383001.png\"><br>\nIf the computer runs Windows XP or earlier, you must install Windows Media Player 11 to use MTP mode.&nbsp;<br>\n- &nbsp;Photos: In this mode, you can access photos saved to your HUAWEI MediaPad's internal storage by opening the computer's new disk drive and transfer those photos between your HUAWEI MediaPad and computer. <br>\n<img border=\"0\" src=\"http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150730170702253001.png\"><br>\nThis mode is not supported on some models.&nbsp;<br>\n- &nbsp;USB drive: In this mode, you can access files saved to your HUAWEI MediaPad's microSD card by opening the computer's new disk drive and transfer those files between your HUAWEI MediaPad and computer.&nbsp;<br>\n- &nbsp;HiSuite: In this mode, the computer starts HiSuite, with which you can transfer files between your HUAWEI MediaPad and computer and install applications on your HUAWEI MediaPad. <br>\n<img border=\"0\" src=\"http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150730170737739001.png\"><br>\nAfter HiSuite is installed, you can manage files, such as contacts and images, on your HUAWEI MediaPad using HiSuite. However, this mode is not supported on some models.</p>","faqTypeId":null,"faqType":null,"useful":15,"unUseful":14,"languageId":242,"languageName":"id","faqCode":"1048","faqTypeCode":null,"isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1438247263000,"seriesProductName":"7D-501L,7D-501u,S8-301u,S8-701u,T1-701u","visitedTimes":2329,"isUsefulFlag":null,"score":0,"times":0,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":0.0,"createDate":null,"totalPages":null}