{"type":null,"faqId":5146,"title":"How can I configure a  computer to use a static IP address?","answer":"Take a computer that runs Windows XP as an example. To configure the computer to use a static IP address, do as follows:\nStep 1:In the Control Panel window, double-click Network Connections to display the Network Connections window.\nStep 2:In the Network Connections window, right-click the working Local Area Connection and choose Properties.\nStep 3:In the This connection uses the following items group box of the Local Area Connection Properties dialog box, select Internet Protocol (TCP/IP). Click Properties.\nStep 4:Select Use the following IP address.\nStep 5:Set the IP address of the computer and ensure that the IP address is in the same network segment as the local area network (LAN) IP address of the terminal.\nAssume that the default LAN IP address of the terminal is 192.168.1.1. To set the IP address of the computer, do as follows:\n1. In IP address, enter 192.168.1.100. Ensure that this IP address is unique and not used by other computers.\n2. In Subnet mask, enter 255.255.255.0.\n3. In Default gateway, enter 192.168.1.1.\nStep 6:Consult your network service provider about the IP address of the domain name server (DNS). In Preferred DNS server and Alternate DNS server, enter the IP address.\nIf you configure the static IP address for the purposes of accessing the Web configuration page of the terminal, you can skip this step.\nStep 7:In the Internet Protocol (TCP/IP) Properties dialog box, click OK. Then in the Local Area Connection Properties dialog box, click OK.","faqTypeId":null,"faqType":null,"useful":0,"unUseful":1,"languageId":1,"languageName":"en","faqCode":"5146","faqTypeCode":null,"isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1264823640000,"seriesProductName":"","visitedTimes":44,"isUsefulFlag":null,"score":7,"times":2,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":3.5,"createDate":null,"totalPages":null}