{"type":null,"faqId":5194,"title":"What can  I do if the terminal cannot access the Internet through a wireless network adapter?","answer":"Step 1:Ensure that the power cables and telephone lines of the terminal are properly connected.\nStep 2:Check whether the WLAN indicator of the terminal is on.\nIf the WLAN indicator is off, you can infer that the wireless local area network (WLAN) function of the terminal is disabled. In this case, enable the WLAN function.\nFor details about how to enable the WLAN function, see the manual of the terminal.\nStep 3:See the description of the wireless network adapter that is installed on the computer and check whether the wireless network adapter supports the 802.11b and 802.11g protocols.\nIf the wireless network adapter does not support the 802.11b and 802.11g protocols, replace it with the network adapter that supports the protocols.\nStep 4:Check whether the driver for the wireless network adapter is properly installed on the computer.\nIf the driver is improperly installed, install it properly.\nStep 5:Check whether the computer can receive the signals of a WLAN.\nTake a computer that runs Windows XP as an example. To check whether the computer can receive the signals of a WLAN, do as follows:\n1. In the Control Panel window, double-click Network Connections to display the Network Connections window.\n2. In the Network Connections window, right-click Wireless Network Connection and choose View Available Wireless Network.\nIf the computer cannot detect a WLAN, place the computer close to the terminal and ensure that no obstacles such as cement or wooden walls are present between the wireless client and the terminal.\nStep 6:Check whether the computer accesses the WLAN of the terminal successfully.\nCheck the list of wireless network connections and ensure that the terminal is connected to the WLAN.\nStep 7:Check whether you can use the PPP dialing software to dial successfully.\nStep 8:Try to access multiple Web sites to check whether the terminal can access other Web sites.\nIf the terminal cannot access other Web sites either, restore the default settings of the terminal. If the problem persists, contact your network service provider.\n","faqTypeId":null,"faqType":null,"useful":0,"unUseful":1,"languageId":1,"languageName":"en","faqCode":"5194","faqTypeCode":null,"isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1264830867000,"seriesProductName":"","visitedTimes":372,"isUsefulFlag":null,"score":0,"times":0,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":0.0,"createDate":null,"totalPages":null}