{"type":null,"faqId":6582,"title":"E586DS’s Wi-Fi signal is always weak.","answer":"<p>1. When E586DS using it’s battery power, in order to save energy for longer run-time E586DS will lower down its transmit power ,so Wi-Fi signal is weaker compare with powered by USB or power adapter. Connect E586DS to power adapter or with USB cable to a running computer’s USB port will enhance E586DS’s Wi-Fi signal strength.<br>\n2. Keep E586DS at least 3 to 6 feet away from other electrical devices which may create RF signal and cause interference (for example, microwave oven, TVs, cordless/cellular phones, baby monitors or wireless speakers). If you needn’t using any of those devices when you want to connect Internet, please turn it off.<br>\n3. Wi-Fi covered range of E586DS is according to its power supply mode and its using environment. In Idea clear square area the Wi-Fi covered range of E586DS showed below:<br>\n&nbsp;&nbsp;&nbsp; Use power adapter: 100m (328ft)<br>\n&nbsp;&nbsp;&nbsp; Use USB cable connect: 20m (66ft)<br>\n&nbsp;&nbsp;&nbsp; Use battery supply: 10m (33ft)<br>\nIn actual use Wi-Fi covered range maybe different from idea square area, it decided by the environment you use. The closer to E586DS, the stronger Wi-Fi signal you get. And every obstacle (walls, ceilings, furniture) between your device and E586DS may decrease Wi-Fi signal strength. Move your device closer to E586DS can avoid obstacles and improve Wi-Fi signal.<br>\n5. Change the Wi-Fi channel to fix one other than auto (you can try the available channel one by one and select the channel with best signal strength)</p>","faqTypeId":313,"faqType":"Power-on/Power-off","useful":0,"unUseful":0,"languageId":1,"languageName":"en","faqCode":"6582","faqTypeCode":"MBB_Device-Power-On-Off","isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1323314257000,"seriesProductName":"","visitedTimes":131,"isUsefulFlag":null,"score":0,"times":0,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":0.0,"createDate":null,"totalPages":null}