{"type":null,"faqId":6741,"title":"What can I do if I cannot visit Web sites through the terminal?","answer":"<p>\n\t&nbsp;\n</p>\n<p>\n\t1. Check whether the Power indicator of the terminal is on.<br />\nIf the Power indicator is off, perform further checks as follows:<br />\n1) Ensure that the power switch of the terminal is turned on.<br />\n2) Ensure that electricity comes from the socket and that the input power of the socket meets the requirements described on the label of the terminal power adapter. If the voltage is unsteady, for example, if the voltage is too high or too low, do not use the terminal. Wait until the voltage restores to its normal level, and then use the terminal.<br />\n3) Ensure that the terminal is properly connected to the socket through the power adapter.<br />\nIf the Power indicator is still off, contact an authorized maintenance center.<br />\n2. After powering on the terminal, wait for about three minutes. Then check whether the ADSL indicator of the terminal is on.<br />\nIf the ADSL indicator blinks for a long time, perform further checks as follows:<br />\n1) Ensure that telephone lines are properly connected. Especially ensure that the telephone line connecting to the splitter is properly connected.<br />\n2) Ensure that terminal cables or telephone lines are far from the electric appliances that generate strong magnetic or electric fields.<br />\n3) Replace telephone lines.<br />\nIf the ADSL indicator still blinks, contact your network service provider.<br />\n3. Check whether the LAN indicator of the terminal is on.<br />\nIf the LAN indicator is off, perform further checks as follows:<br />\n1) Ensure that the network adapter of the computer is enabled.<br />\n2) Ensure that the network cable between the terminal and the computer is properly connected.<br />\n3) Remove and then insert the network cable or replace the network cable.<br />\nIf the LAN LINK indicator is still off, contact an authorized maintenance center.<br />\n4. Check whether the driver for the network adapter is properly installed.<br />\nTake a computer that runs Windows XP as an example. To check whether the driver for the network adapter is installed, do as follows:<br />\n1) On the desktop, right-click My Computer and choose Manage.<br />\n2) In the navigation tree of the Computer Management window, choose Device Manager.<br />\n3) In the right pane of the Computer Management window, click Network adapters to view the information about the network adapter of the computer.<br />\nIf no network adapter is detected or if a question mark (?) or an exclamation mark (!) is displayed next to the icon of the network adapter, you can infer that the driver for the network adapter is not properly installed. In this case, re-install the driver for the network adapter of the computer.<br />\n5. Ensure that you have entered the correct user name and user password that are required by the PPP dialing software.<br />\n6. Check whether you can use the PPP dialing software to dial successfully.<br />\nIf you cannot use the PPP dialing software to dial successfully, perform further checks as follows:<br />\n1) Stop the PPP dialing software and then power off the terminal. After five minutes, power on the terminal and use the PPP dialing software to dial again.<br />\n2) Restore the default settings of the terminal.<br />\nIf the problem persists, contact your network service provider.<br />\n7. Check whether the proxy server of the Web browser is correctly configured. Take the Internet Explorer installed on a computer that runs Windows XP as an example. To check whether the proxy server of the Web browser is correctly configured, do as follows:<br />\n1) Start the Internet Explorer.<br />\n2) Choose Tools &gt; Internet Options.<br />\n3) In the Internet Options dialog box, click the Connections tab.<br />\n4) In the Proxy server group box of the Local Area Network (LAN) Settings dialog box, ensure that Use a proxy server for your LAN (These settings will not apply to dial-up or VPN connections). is not selected.<br />\n8. Try to access multiple other Web sites to check whether the terminal can access.<br />\nIf the terminal still cannot access other Web sites, contact your network service provider.\n</p>","faqTypeId":null,"faqType":null,"useful":0,"unUseful":0,"languageId":1,"languageName":"en","faqCode":"6762","faqTypeCode":null,"isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1364665108000,"seriesProductName":"","visitedTimes":64,"isUsefulFlag":null,"score":41,"times":16,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":2.6,"createDate":null,"totalPages":null}