{
  "type": null,
  "faqId": 47161,
  "title": "De G6-U10 geeft een melding dat het geheugen vol is, terwijl er nog genoeg ruimte vrij is. Hoe kan ik dit oplossen?",
  "answer": "De G6-U10 heeft in totaal 4 GB beschikbaar voor opslag en het geheugen is uitbreidbaar met een een SD kaart. Van de 4 GB op het interne geheugen is 2 GB is gereserveerd voor het Android besturingssysteem en 2 GB is bedoeld voor uw eigen gebruik. Van deze 2 GB  is 1 GB reserveerd voor applicaties plus bijhorende data en de overige 1 GB is gereserveerd voor uw foto’s, videos en documenten.\r\n\r\n<font style=\"FONT-FAMILY: calibri; FONT-SIZE: 12px\"><font style=\"FONT-SIZE: 14px\">1 GB is bij normaal gebruik meer dan genoeg om de meeste applicaties zonder problemen te installeren. Natuurlijk kunt u indien het geheugen vol is altijd de applicaties naar uw SD kaart verplaatsen (Instellingen à Apps Beheren, selecteer de app die u wilt verplaatsen. Druk vervolgens op **Verplaats naar SD kaart**). Bepaalde applicaties kunnen helaas niet verplaatst worden naar de SD kaart, vanwege privacy beperkingen. Een goed voorbeeld hiervan is What’s App.  Deze applicatie kan door het ontvangen en verzenden van media een groot deel van het intern geheugen vergen. Wij raden u daarom deze data naar de SD kaart of een ander opslag apparaat te verplaatsen. De handleiding hiervoor kunt u vinden op: </font>[<font style=\"FONT-SIZE: 14px\">http://consumer.huawei.com/nl/support/manuals/detail/index.htm?id=55220</font>](http://consumer.huawei.com/nl/support/manuals/detail/index.htm?id=55220)<font style=\"FONT-SIZE: 14px\">. </font></font>",
  "faqTypeId": 221,
  "faqType": "Algemeen",
  "useful": 5,
  "unUseful": 27,
  "languageId": 141,
  "languageName": "nl",
  "faqCode": "2701",
  "faqTypeCode": "1",
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1445005425000,
  "seriesProductName": "",
  "visitedTimes": 3252,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}