{
  "type": null,
  "faqId": 13642,
  "title": "Kako da uradim backup na Huawei telefonu?",
  "answer": " Ø  Za potrebe kreiranja i vraćanja rezevne kopije podataka na *Smartphone* mobilnim uređajima, HUAWEI je obezbedio aplikaciju pod imenom “Rezervna kopija” (“*Backup*” ili “*AllBackup*” - u zavisnosti od modela telefona i verzije softvera); \r\n\r\n Ø  Pored rezervne kopije, kontakata, SMS poruka, registra poziva, sistemskih podešavanja i drugih standardnih podešavanja koji se mogu sačuvati, u zavisnosti od verzije aplikacije moguće je napraviti i kopiju aplikacija instaliranih u telefonu ili čak multimedijalnih sadržaja (fotografija i video snimaka) koji se nalaze u memoriji telefona. \r\n\r\n Na ekranu svog mobilnog telefona, locirajte aplikaciju “Rezervna kopija” koja se, u zavisnosti od modela uređaja i verzije softvera, obično nalazi u folderu “Upravljanje” \r\n\r\n <p> Nakon pokretanja, aplikacija će zatražiti potvrdu opšti uslova i odredbi, kako i politike privatnosti. Nakon potvrde klikom na taster „Počni sada“, otvara se glavni ekran aplikacije koji automatski skenira i prikazuje već kreirane rezervne kopije koje pronalazi na vašem uređaju. </p> <p style=\"margin-left:.5in;text-indent:-.25in;\"> G  *U dnu ekrana je predefinisano aktivirana opcija za šifrovanje svih rezervnih kopija koje ćete kreirati ovom aplikacijom. Time štitite podatke unutar svoje rezervne kopije od neovlašćene upotrebe, nakon što je kreirate. Ukoliko ste sigurni da niko neovlašćeno fizički ne može pristupiti vašoj rezervnoj kopiji (microSD kartici gde će kopija biti sačuvana), možete isključiti ovu opciju.* </p> <p> Za početak kreiranja rezervne kopije, kliknite na taster „Nova rezervna kopija“ </p> <p>   \r\n </p> <p> <p> Nakon što aplikacija učita informacije o modulima, na ekranu će biti izlistani svi moduli čiji se podaci mogu sačuvati u rezervnoj kopiji. Izaberite koje sve module želite da sačuvate u rezervnoj kopiji. </p> <p style=\"margin-left:.5in;text-indent:-.25in;\"> G  *Veličina fajla koju aplikacija kreira zavisi od količine odabranih modula i veličini podataka koji nosi svaki odabrani modul. Obzirom da se rezervna kopija lokalno smešta na spoljnu memoriju (microSD karticu instaliranu u telefon), vodite računa da obezbedite dovoljno memorije za smeštanje rezervne kopije. Ukoliko na microSD kartici nema dovoljno slobodne memorije, aplikacija će vas o tome obavestiti*. </p> <p> Nakon odabira, dodirnite taster „KOPIRAJ“ na kome će biti označen broj odabranih modula </p> <p> <p class=\"MsoNoSpacing\" style=\"margin-bottom:6.0pt;\"> Aplikacija započinje izradu kopije. U zavisnosti od količine podataka po odabranim modulima, proces može trajati od nekoliko sekundi, do nekoliko minuta. Nakon završetka, potvrdite izradu kopije klikom na taster „U redu“ </p> <p class=\"MsoNoSpacing\" style=\"margin-bottom:6.0pt;\"> <p> Nakon izrade kopije, pojavljuje se glavni ekran aplikacije, sa prikazanim svim rezervnim kopijama sa *microSD* kartice telefona, uključujući i novonastalu rezervnu kopiju. </p> <p style=\"margin-left:.5in;text-indent:-.25in;\"> G  *Ukoliko postoji više rezervnih kopija, one ne mogu sve biti prikazane na glavnom ekranu aplikacije. Da biste videli sve rezervne kopije, kliknite na „>> Prikažite više datoteka rezervnih kopija“. Pojavljuje se ekran sa izlistanim rezervnim kopijama.* </p> <p> Svaka kopija beleži datum i vreme kada je napravljena, model telefona na kome je napravljena, veličinu fajla i module koji su sačuvani u rezervnoj kopiji </p> <p>   \r\n </p> <p> <p class=\"MsoNormal\" style=\"margin-top:6.0pt;margin-right:0in;margin-bottom:6.0pt;margin-left:0in;\"> Rezervna kopija je napravljena. Sada možete napustiti aplikaciju „Rezervna kopija“. </p> </p> </p> </p> </p>",
  "faqTypeId": null,
  "faqType": null,
  "useful": 3,
  "unUseful": 0,
  "languageId": 106,
  "languageName": "rs",
  "faqCode": "5302",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1406809983000,
  "seriesProductName": "",
  "visitedTimes": 444,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}