{
  "type": null,
  "faqId": 31722,
  "title": "¿Cuáles son las funciones de mi huella digital?",
  "answer": "Puedes registrar cinco grupos de huellas digitales en modo normal y modo de visitante respectivamente y abrir aplicaciones usando esas huellas digitales. Por ejemplo, en lugar de ingresar la contraseña, puedes usar tu huella digital para desbloquear  tu pantalla,  ingresar a tu cuenta de nube, desbloquear tus aplicaciones y acceder a la caja de seguridad de tus archivos. \r\n\r\nPuedes establecer todas estas funciones en la pantalla de **ID de huella digital. **\r\n\r\nCrea una huella digital y regístrala en tu lista de huellas digitales.\r\n\r\nEl sensor de huellas digitales puede ser utilizado como un botón sensible al tacto. En Cámara, presiona y sostén el sensor por 1 segundo para tomar una foto. Esta función es especialmente conveniente para tomar *selfies.*\r\n\r\n1.         Bloqueo de aplicaciones\r\n\r\nSi no quieres que otros abran ciertas aplicaciones, como por ejemplo WeChat, en tu teléfono, usa la función de huella digital para bloquearlas. Estas aplicaciones solo pueden bloquearse cuando ingresas tu huella digital.\r\n\r\nVe a **Ajustes **> **ID de huella digital**  y habilita la función de bloqueo de aplicaciones. \r\n\r\nVe a **Administrador de teléfono **> **Bloqueo de aplicaciones**, establece la contraseña de bloqueo de contraseña y elige las aplicaciones que quieras bloquear. \r\n\r\n2.         Servicio de nube Huawei\r\n\r\nUsa tu huella digital como identificación de cuenta de nube para operaciones importantes de datos. Por ejemplo, usa tu huella digital para encontrar tu teléfono.\r\n\r\nUsa tu huella digital para modificar los ajustes de información de seguridad de tu cuenta de nube o cerrar sesión. \r\n\r\nUsa tu huella digital para pagar compras en linea.\r\n\r\n3.         Caja de seguridad\r\n\r\nPuedes almacenar tus archivos financieros y otros archivos privados en la caja de seguridad y bloquearla usando tu huella digital. \r\n\r\nVe a **Ajustes **> **ID de huella digital** y enciende **Acceder a caja de seguridad.**\r\n\r\nVe a **Administrador de archivos **> **Categorías **> **Caja de seguridad**, establece la contraseña de seguridad y elige los archivos que deseas proteger. \r\n\r\n4.         Modo de visitante y modo normal\r\n\r\nTu teléfono soporta modo de visitante y modo normal. En modo de visitante, está bloqueada tu información privada. \r\n\r\nPresiona tu dedo derecho contra el sensor para ingresar al modo normal y presiona tu dedo izquierdo para ingresar al modo de visitante. Por ejemplo, cuando tu niño esté jugando con tu teléfono, establece tu teléfono con el modo de visitante. \r\n\r\nVe a **Ajustes **> **ID de huella digital**, establece tu PIN o contraseña y registra tu huella digital. \r\n\r\nVe a **Ajustes **> **Seguridad **> **Privacidad y seguridad**, ingresa el PIN o contraseña y se mostrará la huella digital para desbloquear la pantalla. \r\n\r\nToca **Iniciar** e ingresa la contraseña de visitante para entrar al modo de visitante. Puedes seleccionar una huella digital desde las huellas digitales del propietario o crear una para ingresar al modo de visitante.\r\n\r\nPuedes seleccionar el contenido que quieres mantener privado en el modo de visitante. Para ver la huella digital del propietario y la del visitante, ve a **Ajustes **> **Seguridad **> **Privacidad y seguridad **> **Administrar huella digital.**\r\n\r\nCuando tu pantalla esté apagada o bloqueada, entra al modo de visitante o al modo de propietario usando la huella digital correspondiente.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 103,
  "languageName": "es",
  "faqCode": "6222",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1435172253000,
  "seriesProductName": "Jazz-L09",
  "visitedTimes": 5,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}