{
  "type": null,
  "faqId": 31721,
  "title": "¿Cómo registro mi huella digital?",
  "answer": "Después de establecer tu PIN o contraseña, sigue las instrucciones en pantalla para registrar tu   huella digital.\r\n\r\nCuando estés registrando tu huella digital, presiona tu dedo contra el sensor de huella digital en la parte trasera de tu teléfono alrededor de 0.5 segundos y continúa para presionar los bordes de tu dedo. Se registrarán un total de seis imágenes de la huella digital.\r\n\r\nSerá más fácil para tu teléfono leer tu huella digital si el área que registraste es más grande. Por lo tanto, registra la parte central y los bordes de tu huella digital con cuidado. \r\n\r\nNota lo siguiente:\r\n\r\n1. Las huellas digitales cambian con diferentes elementos del medio ambiente, como la temperatura, humedad, potencia del hidrógeno y la grasa. El registro y lectura de las huellas digitales también se afectan por los patrones de huellas digitales. \r\n\r\n2. Antes de registrar tu huella digital, limpia tus dedos. Mantén tus dedos en condiciones de  humedad y grasa moderadas. Si tus dedos están muy secos o grasosos, puede ser que tu teléfono falle al leer tu huella digital. \r\n\r\n3. Si tus dedos sudan ocasionalmente, se recomienda que limpies tu dedo con un pañuelo antes de desbloquear la pantalla. \r\n\r\n4. Sólo necesitas  presionar tu dedo ligeramente contra el sensor para registrar tu huella digital. No rayes el sensor de huella digitales. Si tus dedos están secos, puede ser que necesites presionar tu dedo con más fuerza contra el sensor. \r\n\r\n![](http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150623040931526001.png)![](http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150623040943542001.png)",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 103,
  "languageName": "es",
  "faqCode": "6221",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1435168850000,
  "seriesProductName": "Jazz-L09",
  "visitedTimes": 8,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "\"huella\" \"huella digital\"  \"fingerprint\" \"mate7\" \"mate 7\"",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}