{
  "type": null,
  "faqId": 13228,
  "title": "E5373s-155’s Wi-Fi signal is always weak",
  "answer": " A: \r\n\r\n 1.       When E5373s-155 using it’s battery power, in order to save energy for longer run-time E5373s-155 will lower down its transmit power ,so Wi-Fi signal is weaker compare with powered by USB or power adapter.  Connect E5373s-155 to power adapter or with USB cable to a running computer’s USB port will enhance E5373s-155’s Wi-Fi signal strength. \r\n\r\n 2.       Keep E5373s-155 at least 3 to 6 feet away from other electrical devices which may create RF signal and cause interference (for example, microwave oven, TVs, cordless/cellular phones, baby monitors or wireless speakers).  If you needn’t using any of those devices when you want to connect Internet, please turn it off. \r\n\r\n 3.       In actual use Wi-Fi covered range maybe different from idea square area, it decided by the environment you use. The closer to E5373s-155, the stronger Wi-Fi signal you get. And every obstacle (walls, ceilings, furniture) between your device and E5373s-155 may decrease Wi-Fi signal strength. Move your device closer to E5373s-155 can avoid obstacles and improve Wi-Fi signal.",
  "faqTypeId": 309,
  "faqType": "Connection and Data",
  "useful": 3,
  "unUseful": 2,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "4272",
  "faqTypeCode": "MBB_Device-Connection-Data",
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1403494021000,
  "seriesProductName": "E5373s-155",
  "visitedTimes": 151,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "E5373s-155",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}