{
  "type": null,
  "faqId": 15080,
  "title": "What can I do if my phone generates excessive heat?",
  "answer": "Whether your phone generates excessive heat depends on how you use your phone. \r\n\r\nl   If you think your phone is generating excessive heat while charging: It is normal for smartphones to generate heat while charging. \r\n\r\nYour phone provides overheating protection for its circuits, helping ensure that the heat will not damage the battery or shorten its life span. \r\n\r\nCharge your phone in a cool and dry place. \r\n\r\nDo not surf the Internet, play games, watch videos, or use other power-intensive application while your phone is charging. \r\n\r\nl   If your phone generates excessive heat while you are playing games: When you play games, your phone CPU runs at high speeds, which generates a lot of heat. This is normal. Huawei phones have all passed safety tests in this regard. Heat generated during normal use will not pose any safety risks. \r\n\r\nIt is recommended that you close background applications not in use while you are playing games. Do not play games while your phone is charging. \r\n\r\nl   If your phone generates excessive heat when you are using data services: How much heat your phone generates when you are using data services depends on the signal reception. If the reception is poor, your phone may generate excessive heat. \r\n\r\nIt is recommended that you move your phone to a place with good reception to use data services. Do not run too many network applications simultaneously to avoid abrupt increases of data traffic and heat generated by your phone. Do not surf the Internet in places with poor reception. \r\n\r\nl   If your phone generates excessive heat during calls: Make calls in places with good reception. Using a headset may also be helpful.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "7339",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1411528379000,
  "seriesProductName": "G630-U00,G630-U10,G630-U20,G630-U251",
  "visitedTimes": 8,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}