{
  "type": null,
  "faqId": 16963,
  "title": "What can I do if my phone automatically powers off or restarts?",
  "answer": "l   Check whether the battery level is too low. If yes, charge your phone.  \r\n If not, the battery may not be properly connected to your phone.\r\n\r\nRemove the battery, use cotton dipped in alcohol to wipe the contacts on the battery and phone, reinstall the battery, and power on your phone again.\r\n\r\nl   Press and hold the power button, and choose **Restart** from the displayed option menu.\r\n\r\nIf no option menu is displayed, press and hold the power button for 10 seconds or more to forcibly restart your phone.\r\n\r\nl   Some third-party applications may not be compatible with your phone.\r\n\r\nBack up important data and restore your phone to its factory settings.\r\n\r\nl   If your phone can't work at all, forcibly update it.\r\n\r\nDownload the update package for your phone from [http://consumer.huawei.com](http://consumer.huawei.com/cn \" \") and follow the update guide in the update package to update your phone.\r\n\r\nl   If the problem persists, contact Huawei technical support or take your phone to an authorized Huawei service center.\r\n\r\nHuawei releases updates at its official website from time to time. For better user experience, use the online update feature to update your phone.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "9641",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1417695113000,
  "seriesProductName": "Jazz-L09",
  "visitedTimes": 9,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}