{
  "type": null,
  "faqId": 20421,
  "title": "Ho do I enroll my fingerprint on the Mate7?",
  "answer": "After you set a PIN or password, follow the onscreen instructions to enroll your fingerprint. \r\n\r\nWhen you are enrolling your fingerprint, press your finger against the fingerprint sensor on the back of your phone for about 0.5 seconds, and continue to press the edges of your finger. A total number of 6 fingerprint images will be enrolled. \r\n\r\nIt will be easier for your phone to read your fingerprint if the fingerprint area you enrolled is larger. Therefore, carefully enroll the center area and the edges of your fingerprint. \r\n\r\nNote the following: \r\n\r\n1. Fingerprints change with different environmental elements, such as temperature, humidity, power of hydrogen, and oiliness. The fingerprint enrolling and reading are also affected by fingerprint patterns. \r\n\r\n2. Before you enroll your fingerprint, clean your fingers. Keep your fingers in a moderate humidity and oiliness conditions. If your fingers are too dry or oily, your phone may fail to read your fingerprint. \r\n\r\n3. If your fingers often sweat, it is recommended that you use tissues to wipe your fingers before you unlock the screen. \r\n\r\n4. You only need to slightly press your finger against the sensor to enroll your fingerprint. Do not scratch the fingerprint sensor. If your fingers are dry, you may need to press your finger against the sensor more strongly. \r\n\r\n ![](http://consumer.huawei.com/support/servlet/imageServlet?dlType=SupportImage&imagePath=/20150317073649423001.png)",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "3983",
  "faqTypeCode": null,
  "isTop": "1",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1426549027000,
  "seriesProductName": "Jazz-L09,Jazz-TL10",
  "visitedTimes": 238,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "mate7, fingerprint",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}