{
  "type": null,
  "faqId": 25273,
  "title": "My phone heats up",
  "answer": " It is normal for a phone to get hot when charging or when using power-intensive apps or functions such as games, web browsing and voice calls. \r\n\r\n It is recommended that you don't use power-intensive features such as web browsing, games, video playback or voice calls while the phone is charging. Please charge your phone in a cool, dry environment. \r\n\r\n It is recommended that you close any background apps that you are not using when playing games. When playing games, the phone's CPU is under heavy strain and will generate considerable heat. \r\n\r\n It is recommended that you use mobile data in locations with strong signal. Please don't run lots of third-party apps at once. This will both use considerable mobile data and cause the phone to heat up. \r\n\r\n It is preferable that you make phone calls in locations with strong signal. \r\n\r\n Huawei will release the latest software versions on its official website. In order to enjoy the best possible user experience, please visit the [Huawei Downloads Page](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ) and find the appropriate download for your model. Alternatively, you can update to the latest software version via an over-the-air update. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "9353",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1430808339000,
  "seriesProductName": "G6-L11,G760-L01,Jazz-L11,S10-231L,S10-231u,S7-721u,Sophia-L10,Y220-U10,Y221-U22,Y330-U01,Y330-U11,Y330-U11,Y511-U10,Y520-U22,Y550-L01",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "heat, hot, charging, phone calls",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}