{
  "type": null,
  "faqId": 26382,
  "title": "Tips for Maintaining Your Phone",
  "answer": "**Tips for Maintaining Your Phone**\r\n\r\n**1. Keep from moisture and rain. **\r\n\r\nIf water or moisture enters your phone, the metal ports and circuits may easily get rusty or short-circuited; therefore, avoid using your phone near the sea or in the rain or mist. Especially keep the phone surface from the rain. If water enters your phone, immediately remove the battery, and send your phone to an authorized Huawei service center. Do not disassemble the phone yourself. \r\n\r\n**2. Keep from dust and grease.**** **\r\n\r\nYour phone constantly gets in touch with your face. The grease on your skin will smudge the phone surface or even damage the internal circuits. Sweat and grease also absorb dust, which poses a threat to the phone's lifespan. To maximize your phone's lifespan, wipe its surface using cotton damped with a small amount of absolute alcohol. Do not clean your phone with strong detergent. \r\n\r\n**3. Keep for direct sunlight and significant temperature changes**** **\r\n\r\nHigh temperature and abrupt temperature change will cause damage to your phone. High temperatures will deform or melt the plastic accessories, internal circuit boards, and battery, while abrupt temperature change may let the moisture condensed from cold air enter the internal parts of the phone, damaging and eroding the circuits and battery. Therefore, do not leave your phone under direct sunlight for too long, and do not bring it to environments with abrupt temperature changes. \r\n\r\n**4. Avoid bumping and thunder strikes**** **\r\n\r\nWhen holding your phone in your hand, make sure it's not pressed or bumped; otherwise, black spots or even damage may occur on the LCD, and circuit components may be disconnected. Do not use your phone outdoors or in an open area during thunderstorms to avoid thunder strikes. \r\n\r\n**5. Keep from high temperature**\r\n\r\nExperiments show that when a Li-ion battery is stored at 0°C–10°C for a month, its battery level can be maintained at about 90%; when stored at 30°C–40°C for a week, the same battery only has 60% of battery power remained. This shows that high temperature significantly degrades the battery performance.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "828",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165442000,
  "seriesProductName": "",
  "visitedTimes": 60,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Tips for Maintaining Your Phone",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}