{
  "type": null,
  "faqId": 26406,
  "title": "Eight Inaccurate Sayings About Phones",
  "answer": "**Eight Inaccurate Sayings About Phones**\r\n\r\n**1. ****Calls can be tapped if the SIM card is copied using the phone number. **\r\n\r\nSIM cards cannot be copied using only a phone number. If your SIM card is stolen, its data may be copied, but your calls will not be tapped. If your SIM card is lost, replace the SIM card at your service provider's service center.\r\n\r\n**2. The battery of a new phone must be activated by being fully charged and discharged for multiple times. **\r\n\r\nThis saying applies to only Ni-Cd and NiMH batteries. Smartphones now all use Li-ion batteries without memory effects. You can charge Li-ion batteries any time you need. Fully charging and discharging your phone battery regularly may help maximize the battery lifespan. \r\n\r\n**3. It's dangerous to answer calls when charging the phone. **\r\n\r\nThe charger outputs only low voltage DC of 5 V or lower, which imposes no danger if the phone, battery, and charger are qualified even if power leakage occurs on the phone's metal covers. The possibility of electrical shock only exists in extreme conditions, for example, when the phone, battery, or charger are damaged on purpose. However, answering calls while charging your phone causes certain harm to the battery. \r\n\r\n**4. Bank cards will be degaussed if placed together with the phone. **\r\n\r\nOnly bank cards with magnetic stripes may be degaussed, and the energy form of the phone's frequency is electrical field that does not degauss your bank cards. \r\n\r\n**5. I can call emergency numbers even if my phone does not have reception. **\r\n\r\nCalling emergency numbers also require reception. \r\n\r\n**6. The phone's radiation is 1000 times higher than usual when its battery power is low. **\r\n\r\nThe phone's radiation depends on the signal reception only and is not related with the remaining battery power. \r\n\r\n**7. We must keep at least 40 cm from the phone screen when using the phone. **\r\n\r\nThe recommended distance between your eyes and the screen is about 30 cm. Keep the phone too far from your eyes will cause eye fatigue. \r\n\r\n**8. The electromagnetic wave generated when we use the phone to surf the Internet may lead to cancer. **\r\n\r\nThe electromagnetic wave generated by phones has minor influence on the human body. If your phone is qualified, the electromagnetic wave's strength is in a save range even if increased by tens of thousands of times. Phones are now listed as 2B carcinogens, which means carcinogens that may lead to cancers. Actually, kimchi and coffee are also listed as the same grade with extremely low possibility of causing cancers.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "785",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433162846000,
  "seriesProductName": "",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Eight Inaccurate Sayings About Phones",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}