{
  "type": null,
  "faqId": 26404,
  "title": "Dark Photos When Taken in Backlight Environments",
  "answer": "**Dark Photos When Taken in Backlight Environments**\r\n\r\nThe HDR feature can help you take bright photos even in backlight environments. \r\n\r\n**[Introduction to HDR]**\r\n\r\nHigh Dynamic Range (HDR) helps solve the problem that the camera's dynamic range is restricted when you take photos of objects whose brightest and darkest parts contrast significantly. With HDR, your phone processes multiple photos with different exposure into one photo with rich dark and bright details. \r\n\r\nFor example, if you take photos of a person in strong light, the person's face look dark in backlight. If you focus on the person's face, the background light looks too bright and the face gets blurred. To take a photo with balanced exposure, enable HDR and focus on the person. \r\n\r\n**When should we use HDR?** Applicable scenarios include but are not limited to portrait in backlight, scenery in strong light (such as the blue sky, white clouds, and green grasses), and indoor shooting with strong light shining into the window. \r\n\r\nInapplicable scenarios include but are not limited to shooting moving objects or in good light conditions (balanced light without abrupt strong lights). \r\n\r\n**[Tip]**\r\n\r\nWhen you use HDR, if you do not want the phone to save the original photo and HDR photo simultaneously, go to **Settings** and turn off the option of saving the photo with normal exposure.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "783",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433162642000,
  "seriesProductName": "",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Dark Photos When Taken in Backlight Environments",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}