{
  "type": null,
  "faqId": 26405,
  "title": "Deciding Whether to Install Applications to Your Phone Storage or microSD Card",
  "answer": "**Deciding Whether to Install Applications to Your Phone Storage or microSD Card**\r\n\r\n**Phone storage or microSD card? Let me share with your some problems that may occur on microSD cards: **\r\n\r\n**1. As the data processing speeds of microSD cards are often slower than those of the system ROM, installing applications to a microSD card may make your system response speeds slow, especially when you have installed many applications. **\r\n\r\n**2. If you remove the microSD card from your phone, you will not able to access applications installed on it. **\r\n\r\n**3. Phones running Android 2.3 and some phones running Android 4.0 do not support MTP; therefore, if you install too many applications to the microSD card, you will find the computer runs slowly when you connect your phone to the computer and use the phone as a USB drive. The more applications you installed, the slower the computer operations speeds are. **\r\n\r\n**4. Frequent data reading and writing will shorten your microSD card's life span. If the microSD card quality is poor, your data may be lost. **\r\n\r\n**Then why do we offer a function for users to install applications to the microSD card?**\r\n\r\n**Versions earlier than Android 2.3 do not provide the option of installing applications to the microSD card. At that time, the 512 MB ROM provides only storage space of 200 MB for users, which can be used to store about 50 applications. Therefore, Google added the \"APP2SD\" function in Android 2.3 to address the issue of insufficient ROM storage space. **\r\n\r\n**Currently, most phones have eMMCs of up to 4 GB as their ROM. The storage space at users' disposal is as much as 600 MB or even 2 GB, which can accommodate more applications than common users would install. Considering the shortcomings of the \"App to SD\" function, such a function has become unnecessary. **\r\n\r\n**In conclusion, try not to install your applications to the microSD card. **\r\n\r\n**Tips: If your phone's internal storage is taken up by too many files, you can save large files, such as games, songs, and movies, to the microSD card, and save the internal storage for your applications. **",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "784",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433162712000,
  "seriesProductName": "",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Deciding Whether to Install Applications to Your Phone Storage or microSD Card",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}