{
  "type": null,
  "faqId": 26410,
  "title": "Handling Breakdown",
  "answer": "**Handling Breakdown**\r\n\r\nIt is not rare to encounter phone breakdown, but frequent breakdown will affect user experience. Try the following methods to prevent or handle breakdown. \r\n\r\n**1. ****Do not run too many applications simultaneously. **\r\n\r\nInstead of exiting an application, some users are used to simply returning to the home screen. However, the application keeps running in the background. If too may applications are running simultaneously, your phone may break down. Exit applications when you do not need them, and run only one large application at a time. \r\n\r\n**2. Regularly scan for viruses.**\r\n\r\nYour phone may be attacked by viruses. Try to scan for and eliminate viruses using a security application. If the problem persists, save important data and restore your phone to its factory settings or format the microSD card. \r\n\r\n**3. Check the microSD card.**\r\n\r\nRemove the microSD card and check whether the problem persists. If the problem is solved, the microSD card may have data protection or conflict. Delete unnecessary items one by one, or format the microSD card. \r\n\r\n**4. Do not operate your phone too quickly if its specifications are low. **\r\n\r\nSending commands too quickly to the phone may result in breakdown if your phone's specifications are low. \r\n\r\n**5. Check whether the battery is properly connected to peripheral components. **\r\n\r\nIf your phone has been used for a long time, the battery may fail to connect to peripheral components. Restore your phone to its factory settings and check whether it still frequently breaks down. If yes, replace the battery. **6. Do not play large games while charging. **\r\n\r\nYour phone is prone to breakdown when its temperature is high, which is its self-protection mechanism. If your phone generates excessive heat, do not play large games while charging it.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "789",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433163476000,
  "seriesProductName": "",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Handling Breakdown",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}