{
  "type": null,
  "faqId": 26417,
  "title": "Protecting Your Eyesight",
  "answer": "**Protecting Your Eyesight**\r\n\r\nDear friends, how long have you been using your phone? Are you experiencing any eye dryness and fatigue?\r\n\r\nIf yes, you should be concerned, because staring at the phone screen for too long will not only cause eye dryness and fatigue, but may also permanently affect your eyesight. So how should we prevent eyesight damage?\r\n\r\nThe primary factor of phone screens that damages your eyesight is a short-wave radiation called \"blue ray\". The wavelength of visible lights in the nature is from 400 nm to 700 nm. In the range of 400 nm to 500 nm, the color sensed by human eyes is blue. Therefore, this band is called \"blue ray\". Phones apply a large amount of blue ray to make the screen light whiter and brighter. \r\n\r\nThe high-energy blue ray is similar to the well-known ultraviolet. It can pass crystal crystalline lens and reach the retina. The blue ray can cause the retina's epithelial cells to decay and lead to irreversible eyesight damage.\r\n\r\n**[Hazards of Blue Ray]**\r\n\r\nA research conducted by Harvard University shows that if you use your phone before sleeping, the high-energy emitted by the phone will stimulate your brain and keep it excited. You will need a long time to fall asleep, and you may wake up for multiple times or even experience insomnia. \r\n\r\nThe WHO' International Eye Protection Organization issued an orange alert for blue ray radiation's potential threats. \r\n\r\n**[Fighting Against Blue Ray]**\r\n\r\nAnti-blue ray lens: If you wear glasses, anti-blue ray lenses are recommended. This way, you can protect your eyes from blue ray no matter when using your phone, computer, or tablet. \r\n\r\nAnti-blue ray protective film: Attaching an anti-blue ray protective film to your phone is the most straightforward and simple way to protect your eyes from blue ray. The anti-blue ray protective film can protect your phone and your eyes. However, attaching the protective film may affect your viewing experience because a technique is applied to rectify the anti-blue ray protective film's yellowish and overly warm display effects. \r\n\r\nReduce the backlight: The blue-ray's influence on your eyes is weakened when the backlight is reduced. Do not use your phone or computer in a dark environment, because the strong contrast between the dark environment and the bright screen will cause great harm to your eyes. Note: Do not adjust the backlight to too low; otherwise, your eyes will be exposed to harm. \r\n\r\nEnhance your immune system: Eat more vegetables and fruits containing anti-oxidation elements, such as lutein and vitamin C. \r\n\r\nDo not use your phone for too long: While using your phone, take rest from time to time to better protect your eyes.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "796",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433164522000,
  "seriesProductName": "",
  "visitedTimes": 5,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Protecting Your Eyesight",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}