{
  "type": null,
  "faqId": 26415,
  "title": "Noise Reduction Headset",
  "answer": "Noise Reduction Headset\r\n\r\nSome may think noise reduction headsets are headsets with thicker foam and more rubber. This kind of noise reduction headsets is called \"passive noise reduction headsets\". There is another type of headsets called \"active noise reduction headsets\" that offset ambient noise of calls and songs through a certain algorithm. The difference between them is that the passive noise reduction headsets reduce the high frequency sounds, while active noise reduction headsets reduce the low frequency sounds. \r\n\r\n**Offsetting noise with noise**\r\n\r\nPassive noise reduction headsets isolate noise using foam and rubber, which is not effective on low frequency sounds. \r\n\r\nActive noise reduction headsets not only isolate ambient noise, but also emit a noise that can offset the ambient noise. However, active noise reduction headsets are not effective when dealing with human voices or noise emitted from airplanes and trains. \r\n\r\nNote: Human voices and car horning are high frequency sounds. You can still hear others talking to you and car horns when wearing headsets. Low frequency sounds are mostly real noises. Active noise reduction headsets have obvious advantages in terms of dealing with low frequency noises. \r\n\r\n**Choosing between passive and active noise reduction headsets**\r\n\r\nActive noise reduction headsets are more expensive. If you have a limited budget, choose a passive noise reduction headset with good quality. If not, active noise headsets are better choices. Some high-end active noise reduction headsets also provide features of passive noise headsets.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "794",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433163817000,
  "seriesProductName": "",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Noise Reduction Headset",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}