{
  "type": null,
  "faqId": 26413,
  "title": "Miss understanding About Phone Maintenance",
  "answer": "**Misunderstanding About Phone Maintenance**\r\n\r\nHave you ever heard of the following sayings about phone maintenance? And are they true? \r\n\r\n**Turning on the flashlight for too long will burn the flash. **\r\n\r\nTruth: The flash next to the camera is an LED whose lifespan is up to tens of thousands of hours. So you can be assured that using your phone as a flashlight at night will not cause any damage to your phone. \r\n\r\n**The higher the camera resolution, the better the photo quality. **\r\n\r\nTruth: The camera resolution determines the photo size only. It is the light sensing component that determines the photo quality. The more light received by each pixel, the better the photo quality. \r\n\r\n**Power saving applications can effectively save the battery power.**\r\n\r\nTruth: The only function of power saving applications is to remind you to disable some unnecessary functions and close background applications and processes that have been idle for a long time. Some power saving applications may even increase power consumption by monitoring power consumption statistics and taking up system resources. \r\n\r\n**The phone will explode if you charge it all night long. **\r\n\r\nTruth: This saying is similar to \"long-time charging will damage the battery\", which does not have any substantial evidence. Most smartphones nowadays adopt Li-ion batteries that automatically disconnect from power sources once fully charged. Therefore, they do not have such issue as over-charging. Your phone will not explode if you use the original charger.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "792",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433163682000,
  "seriesProductName": "",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Miss understanding About Phone Maintenance",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}