{
  "type": null,
  "faqId": 26419,
  "title": "Reasons for Calling or Messaging Failures",
  "answer": "**Reasons for Calling or Messaging Failures**\r\n\r\nThis document provides reasons for such problems as your phone cannot be connected when someone calls you, calls are interrupted, messages are delayed or fail to be received. \r\n\r\n**[You may be in a signal blind area.]**\r\n\r\nYour phone may fail to be connected or calls may be interrupted if you are in a signal blind area, such as a suburb area between mountains or fields without network communication equipment or an urban area where signals are blocked by obstacles. \r\n\r\n**[The signal may be interrupted.]**\r\n\r\nDuring important exams, anti-cheating jammers may be enabled around the exam rooms. Keep away from the jammers or wait until the exam ends. \r\n\r\n**[You may be moving from one place to another.]**\r\n\r\nIf you are switching from one service cell to another during a call, your voice channel needs to be switched to the new cell. If the new cell is busy and there is no channel to be assigned, the call will be interrupted. \r\n\r\n**[You may be experiencing a network rush hour or error.]**\r\n\r\nIf you cannot make calls in a busy commercial district, you may be experiencing a network rush hour or network error. Wait for a while and try again. \r\n\r\n**[The SIM card may not be properly connected to your phone.]**\r\n\r\nCheck whether the SIM card is clean. If not, clean the SIM card and properly install it.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "798",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433164663000,
  "seriesProductName": "",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Reasons for Calling or Messaging Failures",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}