{
  "type": null,
  "faqId": 26412,
  "title": "Maximizing the Battery Lifespan",
  "answer": "**Maximizing the Battery Lifespan**\r\n\r\nDid you ever encounter the following problems? 1. The battery cannot be fully charged. 2. The battery level of a fully charged battery changes back to 98% once you disconnect your phone from the charger. Instead of poor battery quality, these problems are probably resulted from incorrect battery usage. \r\n\r\nBasic maintenance of a battery is as follows: \r\n\r\n1. Use the original charger. Travel chargers and universal chargers may make the battery swell if you charge the battery for too long. 2. Charge the battery from time to time. Do not wait until the battery is depleted to charge it; otherwise the radiation will be increased and the battery will be damaged. 3. Do not play games or watch HD videos while charging; otherwise your phone will be overheated or even damaged, and the battery performance will be degraded. 4. If your phone generates excessive heat while charging, remove the protective case. 5. Remove power saving applications, whose functions are provided by your phone already. Installing them may increase power consumption instead. 6. Keep your phone from environments that are too hot or too cold. For example, do not place your phone in direct sunlight or under an air-conditioner. 7. Disconnect your phone from the charger once it is fully charged to prevent overheating. The battery lifespan can be maximized if you use your phone properly.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "791",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433163605000,
  "seriesProductName": "",
  "visitedTimes": 4,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Maximizing the Battery Lifespan",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}