{
  "type": null,
  "faqId": 26414,
  "title": "Musts and Must-Nots If Your Phone Drops into Water",
  "answer": "**Musts and Must-Nots If Your Phone Drops into Water**\r\n\r\n**What should we do and not do if the phone drops into water?**\r\n\r\n**[Musts]**\r\n\r\n**1. Immediately take out your phone from the water, remove the battery, SIM card, and microSD card. **\r\n\r\n**Once water enters your phone, your phone will be powered off because of power supply interruption or short circuit. Therefore, the battery must be immediately removed in case the main board is burnt because of long-time short circuit. **\r\n\r\n**Caution:**\r\n\r\n**The first thing many people would do after taking out the phone from the water is to check whether the phone can be powered on, which increases the possibility for the main board to be burnt if the phone is short-circuited. **\r\n\r\n**2. If your phone drops into corrosive liquids, immediately wash it with clean water. **\r\n\r\nThere are many small parts and circuit chips inside the phone that are prone to erosion. Even the erosion of a small area on delicate parts will affect the overall phone performance. Therefore, wash the phone with clean water as soon as possible to dilute the corrosive liquid. \r\n\r\n3. Remove the water by swinging the phone. \r\n\r\nThe longer the water stays in your phone, the greater the damage it will cause to your phone. Try to sop the water using a piece of cloth or tissue. \r\n\r\n**To solve this problem:**\r\n\r\n**Hold the phone with its top facing up and swing it forcibly toward a direction to avoid spreading the water to all parts inside the phone. **\r\n\r\n**4. Air dry the water. **\r\n\r\n**A small amount of water will affect the phone performance or may even cause short circuit or burn the circuit boards. **\r\n\r\n**To solve this problem:**\r\n\r\n**a. Use cold air from an air dryer to dry the water. Hot air may cause damage to the phone parts. **\r\n\r\n**b. Place the phone vertically in a cool and dry place. **\r\n\r\n**c. Place the phone into a bag of rice. Rice has strong water-absorbing capability and can effectively protect your phone from moisture. **\r\n\r\n**5. Take your phone to an authorized Huawei service center. **\r\n\r\nInstructions 1 to 4 are common first-aid steps for your phone and cannot completely remove water from your phone. Therefore, do not power on the phone yourself after completing these operations, and take your phone to an authorized Huawei service center as soon as possible. \r\n\r\n**[Must-nots]**\r\n\r\na. Do not power on your phone after taking it out from the water. \r\n\r\nb. Do not use hot air when drying the water using a hair dryer. \r\n\r\nc. Do not keep the phone in direct sunlight. \r\n\r\n**This cannot be over-emphasized: **\r\n\r\n**Do not power on your phone if water enters it. **",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "793",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433163764000,
  "seriesProductName": "",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Musts and Must-Nots If Your Phone Drops into Water",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}