{
  "type": null,
  "faqId": 26427,
  "title": "Ten Photo Taking Tips",
  "answer": "**Ten Photo Taking Tips**\r\n\r\n**Smartphones' photo-taking capabilities are getting more and more advanced. Some smartphones are even better than compact cameras. This document provides some tips to help you take stunning photos with your phone. **\r\n\r\n**1. ****Keep your phone steady. **\r\n\r\n**Smartphones are light and can be easily shaken, because of which photos will be blurred. Keep your phone when holding it, especially when your phone does not support optical image stabilization. **\r\n\r\n**2. Do not use digital zoom. **\r\n\r\n**Digital zoom will decrease the photo quality. To crop your photos, use the built-in photo editing application on your phone. **\r\n\r\n**3. Use the best resolution and aspect ratio. **\r\n\r\n**Go to the settings menu of the camera, and choose the highest resolution. The Honor 6 Plus adopts a 16:9 light sensor that can take wide-screen photos. For other phones, choose the 4:3 aspect ratio. **\r\n\r\n**4. Regularly wipe the camera lens with a piece of soft cloth. **\r\n\r\n**5. Adjust the focus and exposure by touching the viewfinder. **\r\n\r\n**If you find the exposure is inaccurate or the photo is out of focus, simply touch the object you are shooting on the viewfinder. **\r\n\r\n**6. Use the trisecting method. **\r\n\r\n**Trisecting is an easy way for composing a photo. Trisect the viewfinder using your eyes or the gridlines on your phone, and place the object you are shooting along the vertical line, or a crosspoint of vertical and horizontal lines. Make sure the ground is parallel with the horizontal line. **\r\n\r\n**7. Learn about different capture modes. **\r\n\r\n**Most smartphones provide a variety of photo-taking functions. For example, you can remove a moving object from the photo or add special effects. Different capture modes are available that allow you to take photos with different styles without manual configuration.**\r\n\r\n**8. Try third-party camera applications. **\r\n\r\n**Developers provide all kinds of third-party camera applications for Android phones, iPhones, or Windows phones. These applications bring many other functions that are unavailable in the built-in camera. **\r\n\r\n**9. Take multiple photos at a time for selection. **\r\n\r\n**No matter you are taking photos using a phone or camera, take multiple photos at a time so you can have alternative photos if someone blinks his or her eyes or the photos get blurred.**\r\n\r\n**10. Edit the photos to a reasonable extent. **\r\n\r\n**Filters can bring an artistic sense to your photos when properly used. Do not overly apply filters to avoid aesthetic fatigue. Other good methods for editing your photos are adjusting the contrast and brightness and cropping the photos. **",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "826",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165227000,
  "seriesProductName": "",
  "visitedTimes": 6,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Ten Photo Taking Tips",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}