{
  "type": null,
  "faqId": 26429,
  "title": "Tips for Charging Your Phone",
  "answer": "**Tips for Charging Your Phone**\r\n\r\nWhen charging your phone, have you ever encountered such issues as excessive heat or failure to fully charge the phone after charging it for a long time? Do these issues cause any harm to your phone and charger? What are the precautions regarding charging the phone?\r\n\r\n1. Do not answer calls while charging the phone. When your phone is charging, the insulator between parts with high voltage and touchable conductive parts may be broken down or the contact current may be excessive. Answering calls while charging may even cause fire if you are using a charger with poor quality. \r\n\r\n2. Use the charger that comes with your phone instead of a universal charger. Common universal chargers are produced by non-authorized manufacturers. The universal chargers usually do not have protective circuits, providing excessive voltage and current and unstable performance. Excessive voltage may make the battery bump or even explode.\r\n\r\n3. Make sure the charger is of good quality. Choose a charger from authorized manufacturers. According to fire fighting experts, qualified chargers have over-heat protection circuits. When the internal temperature reaches a certain value, the charger automatically disconnects from the power source. \r\n\r\n4. Charge your phone in a dry and cool place. When your phone is charging, its voltage is higher than in standby mode. Charging your phone in a hot or damp environment may lead to accidents. The risk is even higher if you use a battery or charger of poor quality. \r\n\r\n5. Do not leave your phone unattended while charging. Keep an eye on your phone when charging it so that you can handle such exceptions as overheating or burnt smell in a timely manner. If such exceptions occur, stop charging. Do not resume charging unless you have found out the reason and solved the issue. \r\n\r\n6. Disconnect the charger from the power source after charging. Do not forget to unplug the charger in case of fires.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "803",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165377000,
  "seriesProductName": "",
  "visitedTimes": 28,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Tips for Charging Your Phone",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}