{
  "type": null,
  "faqId": 26424,
  "title": "Taking Care of Your Headset",
  "answer": "**Taking Care of Your Headset**\r\n\r\nWhen the headset suddenly fails to work, some may think the headset quality is poor or lifespan is short. However, this problem may be caused by improper use of the headset. \r\n\r\n**[Important notes]**\r\n\r\nPay attention to the following aspects when using your headset. \r\n\r\nPlug: When removing the headset, hold the plug with your finger and pull it out. Do not unplug the headset by pulling the headset cable. Otherwise the cable may be broken. \r\n\r\nCable: Do not forcibly pull the headset cable. Wipe sweat from the headset cable if any, because grease will shorten the cable's lifespan. \r\n\r\nFoam cover: The foam covers on earpieces can not only prevent slipping and sound leakage, but can also help improve sound quality, make low frequency sounds feel thicker, and prevent resonance between the earpieces and ear bones when the volume is too high. \r\n\r\n**[Daily maintenance]**\r\n\r\nTake care of your headset in daily use. \r\n\r\n**1. **When wearing your headset, avoid direct contact with the cable. Otherwise, the cable may be smudged and aged by your sweat. \r\n\r\n**2. **Keep the headset from moisture. If the solder pad inside the earpiece gets rusty, the headset's resistance will increase, and the headset may generate deviated sounds. \r\n\r\n**3. **Clean the headset regularly. The earpieces are in direct contact with your canal, therefore, if they are not clean, your health may be jeopardized. \r\n\r\n**4. **Keep the headset from strong magnetic fields; otherwise, the internal components of the headset may be degaussed, the components' sensitivity will be reduced, and sound quality will be degraded. \r\n\r\n**5. **Do not disassemble the headset yourself. It has been proved that 80% of non-professional disassembly will lead to headset failures or sound deviation. \r\n\r\n**6. **Do not adjust the headset volume to too high to avoid damage to your ears and the headset. \r\n\r\n**7. **Do not use the headset outdoors in winter. When used in low temperatures, the cable becomes harder and brittler. If overly bent, the cable will be broken. \r\n\r\n**8. **Keep the headset from chemicals. The paint on the earpieces' covers can be easily dissolved by chemicals. \r\n\r\n**9. **When you do not need the headset, keep it in a bag or roll it up with a reel instead of winding it around your phone. \r\n\r\n**10. **Do not wear the headset in bed because the cable may be broken if you accidentally pull it hard after you fall asleep.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "823",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165023000,
  "seriesProductName": "",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Taking Care of Your Headset",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}