{
  "type": null,
  "faqId": 26428,
  "title": "Ten Tips for Taking Photos with Your Phone",
  "answer": "**Ten Tips for Taking Photos with Your Phone**\r\n\r\nThere are some skills you need to grasp regarding taking photos with your phone. \r\n\r\nMake sure you and your phone are equipped with the following: \r\n\r\n1. Resolution of 5 MP or above\r\n\r\n2. Flash and different shooting modes, such as night mode\r\n\r\n3. Basic applications for processing images\r\n\r\n4. Sufficient battery power (because photo shooting incurs high power consumption)\r\n\r\n5. Basic aesthetic knowledge (sense of beauty)\r\n\r\n6. Good patience (may be required when you want to take stunning photos)\r\n\r\n7. (Optional) Macro lens\r\n\r\n**Ten tips for taking photos**\r\n\r\n**1. Make sure your hands do not shake.**\r\n\r\nThe first thing you need to learn is to keep your hands steady so that the photos are not blurred. It is recommended that you hold the phone with both hands. \r\n\r\n**2. Press and hold the shutter bound for 3 seconds. **\r\n\r\nYou may have found that your phone's shutter is different from that of the camera. Cameras' shutter is triggered within 1 second (unless the shutter speed is adjusted). After your phone's shutter is pressed, the phone CPU needs some time to send the shooting command to the shutter. If you release the shutter too soon or not firmly enough, the photo may be blurred. Therefore, you are advised to press and hold the shutter for three seconds when taking photos.\r\n\r\n**3. Make use of the light. **\r\n\r\nYou can try taking photos in different light conditions. If the light is insufficient, turn on the flash or night mode. You can also turn off the flash for special effects, which requires more time and attempts. You can achieve different effects by adjusting the brightness on your phone. \r\n\r\n**4. Set the photo scene properly. **\r\n\r\nApart from light, you have to handle the scene for the photo well. Photo scenarios are usually classified into panorama and close-up. When you take a panoramic photo, stand in a place with an open view. When you take a close-up photo, control the light properly. \r\n\r\n**5. Take photos in side light. **\r\n\r\nStand in the direction of the light and take photos of objects and people under the light. For example, the light refraction in sunset. You can also ask the model to stand in the sun and take photo from his or her shadow. This is called shadow backlight shooting. \r\n\r\n**6. Stay close to the object you are shooting. **\r\n\r\nCommon phones do not support adjusting the focal length. When you shoot portraits from a long distance, the photos will be blurred. (This does not apply to scenery, which requires far focusing.) The best distance to the shooting object is 1–2 feet. \r\n\r\n**7. Use the golden mapping method.**\r\n\r\nGolden mapping provides the best split point in aesthetics. Instead of being at the center of the viewfinder, the model should stay slightly to the left to form a better image. \r\n\r\n**8. Shoot from the horizontal angle. **\r\n\r\nKeep your eye, the camera lens, and the model's eyes on the same level. For example, you can use this method when capturing a certain expression in one's eyes or a facial expression. You can lower the shooting angle to shoot the model's feet to present a special work. \r\n\r\n**9. Take advantage of the background. **\r\n\r\nThe application of background is applicable to all shooting techniques. You can emphasize a certain part on the model or make a certain one in the background outstand using the model. \r\n\r\n**10. Install color adjusting applications on your phone. **\r\n\r\nEven photos taken by professional photographers require color adjustment. Using color adjusting applications help beautify your works and make them unique. You can adjust the colors for your photos the way you like.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "827",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165309000,
  "seriesProductName": "",
  "visitedTimes": 17,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Ten Tips for Taking Photos with Your Phone",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}