{
  "type": null,
  "faqId": 26422,
  "title": "Saving Your Mobile Data Traffic",
  "answer": "**Saving Your Mobile Data Traffic**\r\n\r\nWhy do smartphones consume so much mobile data traffic? What should we do to save the mobile data traffic?\r\n\r\n**Why do smartphones consume so much mobile data traffic?**\r\n\r\nSmartphones require data connection for system updates and data synchronization. Some malicious applications, games, or embedded advertisements also access the Internet in the background. \r\n\r\n**What should we do to prevent excessive mobile data consumption in the background?**\r\n\r\n**1. ****Disable auto-sync on your phone.**\r\n\r\nYour phone can automatically back up important data to the cloud, which incurs a lot of mobile data traffic consumption, especially when auto-upload of photos is enabled. \r\n\r\n**2. ****Disable mobile data when you do not need it. **\r\n\r\nDrag the status bar downward to display the shortcut switch panel. Touch the mobile data switch to disable mobile data. \r\n\r\n**3. ****Disable mobile data when you are using Wi-Fi.**\r\n\r\nYour phone automatically switches to the mobile data connection when Wi-Fi reception is poor, incurring mobile data traffic without your knowledge. \r\n\r\n**4. ****Enable mobile data traffic monitoring and restriction.**\r\n\r\nThe Phone Manager pre-installed in Huawei phones provides real-time mobile data traffic monitoring. You can view your mobile data usage, enable warning thresholds, and prevent some applications from accessing your mobile data. \r\n\r\nNote: You are not advised to root your phone because it may void your phone's warranty, make the system operation unstable, and incur unknown errors.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "821",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433164870000,
  "seriesProductName": "",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Saving Your Mobile Data Traffic",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}