{
  "type": null,
  "faqId": 26426,
  "title": "Ten Bad Habits of Using Your Phone",
  "answer": "**Ten Bad Habits of Using Your Phone**\r\n\r\nAs smartphones are getting more and more intelligent, they bring us convenient and risks at the same time. This document lists ten issues you may have ignored. \r\n\r\nBad habit 1: The transaction limit for your phone's online banking account is high. \r\n\r\nNowadays, to facilitate your operation, some online payment does not require a password. However, what if your phone is lost? The risk is even higher if you do not set a password for your phone. \r\n\r\nBad habit 2: Your phone is not attached with a protective film. \r\n\r\nYou are advised to attach a protective film to protect your phone from scratches. In addition, if your phone is dropped to the ground, the protective film can prevent the screen from being broken. \r\n\r\nBad habit 3: Your phone is not cleaned regularly. \r\n\r\nPhones have more bacteria than toilets. Clean your phone from time to time. \r\n\r\nBad habit 4: Charge the phone only after the battery power is depleted. \r\n\r\nCharging your phone only after the battery power is depleted significantly reduces your battery's lifespan. Charge your phone once the battery level is lower than 20%.\r\n\r\nBad habit 5: Your phone is not backed up regularly. Important data, such as your contacts and photos, should be backed up regularly, because your phone needs to be formatted when you encounter exceptions. \r\n\r\nBad habit 6: Use your phone while driving. \r\n\r\nFor your safety, wear a headset and microphone if you have to make calls while driving. \r\n\r\nBad habit 7: Connect to unknown Wi-Fi hotspots. \r\n\r\nYour browse history and other personal data may be maliciously copied when you are enjoying a free Wi-Fi access. Use trusted Wi-Fi hotspots only. \r\n\r\nBad habit 8: Never turn off your Wi-Fi and GPS. \r\n\r\nWi-Fi and GPS are power-intensive. Turn them off if you do not need them to maximize your phone's standby time. \r\n\r\nBad habit 9: Scan QR codes from untrusted parties. \r\n\r\nScanning QR codes from untrusted parties may expose yourself to deception. Before you scan a QR code, check its usage and make sure it is provided by official accounts. \r\n\r\nBad habit 10: Set SNS accounts to auto-login. \r\n\r\nIf your phone is lost, your personal data may be leaked.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "825",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433165162000,
  "seriesProductName": "",
  "visitedTimes": 41,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Ten Bad Habits of Using Your Phone",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}