{
  "type": null,
  "faqId": 26434,
  "title": "Using Your Phone While Charging",
  "answer": "**Using Your Phone While Charging**\r\n\r\nThe phone's protective circuits are mainly located near the key components (IC and CPU). When an abnormal current passes the key components or the battery suddenly gets disconnected, the protective circuits provide backup power to keep the phone data from being lost. \r\n\r\nThis situation is called white-screen restart. The IC and CPU of every phone are set with a working current threshold that is generated by data information. If collision or abrupt increase occurs on the data information, the current supplied to the IC and CPU is high. At that time, the protective circuits cut off the current, so your phone will break down and restart at the cost of data loss sometimes.\r\n\r\n**What harm will it do to your phone if you use your phone while charging it?**\r\n\r\nQualified batteries have protective circuits whose output is stable and designed based on the internal restriction current of phones, while unqualified batteries do not. \r\n\r\nIf the battery is not fully charged, using your phone while charging will incur a great amount of heat, which imposes a heavy load on the phone, battery, and charger and may lead to damage to the phone and protective circuits. \r\n\r\nIt is recommended that you fully charge the phone before using it while charging. If the battery power is depleted, it would cause fatal damage to the battery if you charge your phone while using it.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 1,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "833",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1433166366000,
  "seriesProductName": "",
  "visitedTimes": 227,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Using Your Phone While Charging",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}