{
  "type": null,
  "faqId": 30542,
  "title": "Failed to send or receive messages",
  "answer": " Messages cannot be sent or received if your phone has no calling credit. Check whether you have calling credit on your phone. \r\n\r\n Messages may not be sent successfully when the phone is in an area with no signal or with a relatively weak signal. Please try again after moving to an area with stronger signal. \r\n\r\n Messages may not be sent when the phone's battery level is low. Please try again after charging the phone. \r\n\r\n Messages may not be sent successfully when networks are busy, especially at peak messaging times during public holidays. Please try again during off-peak messaging periods. \r\n\r\n Messages may not be sent when the format of the recipient number is incorrect. Please try again after entering the correct number. \r\n\r\n MMS messages cannot be sent when the attachments are larger than 300 KB. Please separate into several MMS messages before sending or send via other means. \r\n\r\n In the messaging app, open the options menu, select Settings and check whether the SMS center number is the number provided by the local network provider. Please contact your network provider if you are unsure of the local SMS center number. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 1,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "5065",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1434598642000,
  "seriesProductName": "EDGE-U00,G610-U20,G6-U10,G700-U10,G730-U10,G750-U10,H30-U10,H60-L04,Holly-U19,Sophia-L10,Y320-U30,Y511-U30,Y520-U22,Y520-U33",
  "visitedTimes": 5,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "SMS, multimedia message, send, receive, failed, error, cannot send, cannot receive",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}