{
  "type": null,
  "faqId": 30701,
  "title": "The touchscreen is slow or unresponsive during normal use",
  "answer": " Check whether there is a screen protector fitted. Some screen protectors affect the touchscreen function when they are badly scratched. \r\n\r\n Opening a large app or lots of background apps may temporarily cause the phone to freeze, making the touchscreen unresponsive. \r\n\r\n Please wait patiently or clean up background apps and then monitor use to see whether the touchscreen has returned to normal. \r\n\r\n Close the background apps that you do not need: go to Settings, select Manage apps and select the apps that you wish to close. Then select Stop and close the app according to the on-screen prompts. \r\n\r\n If your phone features Phone Manager, you can use it to close apps: open Phone Manager, select Phone accelerator and close all background apps in one go. \r\n\r\n If the problem persists, please contact Huawei customer service or take your phone and purchase invoice to a service center for inspection. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "5221",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1434598711000,
  "seriesProductName": "EDGE-U00,G525-U00,G610-U20,G615-U10,G630-U10,G6-U10,G730-U10,G750-U10,Holly-U19,Jazz-L09,Jazz-L11,Sophia-L10,Y221-U22,Y330-U11,Y530-U00,Y600-U20",
  "visitedTimes": 1,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "touchscreen, screen, slow response, delayed response, touchscreen lag, unresponsive",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}