{
  "type": null,
  "faqId": 31049,
  "title": "My phone won't switch on",
  "answer": " If this is the first time you've switched your phone on: \r\n\r\n Before switching on your phone, please charge the battery for half an hour. The first time you switch on your phone, the system will initialize so it is normal if your phone takes longer to switch on. Please be patient. \r\n\r\n If you have restored factory settings or have updated your phone: \r\n\r\n After restoring factory settings or updating your phone, turn it back on. The system will initialize so it is normal if your phone takes longer to switch on. Please be patient. \r\n\r\n If the screen freezes for a long time: \r\n\r\n For phones with removable batteries, please remove then reinsert the battery; for phones with non-removable batteries, please press and hold the power button until the phone vibrates, in order to force a restart. \r\n\r\n If your phone does not switch on after normal use: \r\n\r\n It is possible that your phone switched off automatically due to low battery. Please connect to a charger for a while before turning on your phone. \r\n\r\n Huawei will release the latest software versions on its official website. In order to enjoy the best possible user experience, please visit the [Huawei Downloads Page](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ) and find the appropriate download for your model. Alternatively, you can update to the latest software version via an over-the-air update. \r\n\r\n If the problem persists, please contact Huawei customer service or take your phone and purchase invoice to a service center for inspection. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 1,
  "unUseful": 5,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "5569",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1434601295000,
  "seriesProductName": "EDGE-U00,G6-L11,G6-U10,G760-L01,Jazz-L09,Jazz-L11,Jazz-TL10,Sophia-L10,Y220-U00,Y221-U22,Y330-U11",
  "visitedTimes": 449,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "phone won't switch on; won't turn on; slow startup",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}