{
  "type": null,
  "faqId": 35687,
  "title": "The touchscreen is unresponsive",
  "answer": " Keep your hands and the touchscreen clean and dry, otherwise the touchscreen may become unresponsive. \r\n\r\n Press the power button to turn off the screen and then press the button again to turn the screen back on. Let the screen calibrate itself and then see whether the screen responds. \r\n\r\n If the phone is charging, the touchscreen may not respond properly due to electrostatic currents. Please use the charger provided. If the screen is still unresponsive when using the charger provided, stop charging the phone and see whether the screen becomes responsive. \r\n\r\n If the screen becomes unresponsive when using certain third-party applications, this may be because the third-party application is incompatible with the phone. Uninstall the app, or restore factory settings after backing up important data. \r\n\r\n If one particular area of the screen is consistently unresponsive, this may be due to a problem with drivers, a touchscreen fault, or other error. Please take your phone and purchase invoice to a service center for inspection. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "467",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1437124674000,
  "seriesProductName": "G630-U10,G760-L01,Jazz-L09,Jazz-UL00,S7-721u,S7-722u,S8-301u,S8-701u,Sophia-L10,Y221-U22,Y330-U11,Y520-U22,Y600-U20",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "screen malfunction; screen unresponsive; screen dead spot; touchscreen",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}