{
  "type": null,
  "faqId": 38194,
  "title": "The call volume is very low or there is noise",
  "answer": " You can turn up the call volume during a call using the volume up button. \r\n\r\n Please make calls in an area with strong network signal or low noise levels. \r\n\r\n Aligning the receiver with your ear can help to increase the call volume. \r\n\r\n Please do not cover the microphone (normally on the bottom of the phone) with your fingers or other objects. The sound source should not be too far from the microphone. \r\n\r\n Please use the Huawei headset included when making calls. Other headsets may be incompatible with the phone. \r\n\r\n If you still cannot solve the problem, restart your phone or restore the phone to factory settings after backing up important data. \r\n\r\n If the problem still persists after restarting your phone or restoring the phone to factory settings, please contact Huawei customer service or take your phone and purchase invoice to a service center for inspection. \r\n\r\n Huawei will release the latest software versions on its official website. In order to enjoy the best possible user experience, please visit the [Huawei Downloads Page](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ) and find the appropriate download for your model. Alternatively, you can update to the latest software version via an over-the-air update. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "3414",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1441098535000,
  "seriesProductName": "G610-U20,G630-U10,G760-L01,GRA-L03,GRA-L09,Holly-U19,Jazz-L09,Jazz-L11,Sophia-L10,Y220-U10,Y221-U22,Y360-U61,Y520-U22,Y600-U20,Y625-U32",
  "visitedTimes": 2,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "call, sound quality, quality, noise, volume",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}