{
  "type": null,
  "faqId": 38214,
  "title": "I cannot connect to the Wi-Fi network",
  "answer": " If the Wi-Fi hotspot is password protected, check that you entered the correct password and pay attention to upper and lower case letters. \r\n\r\n Check if the Wi-Fi network name or password was changed. Search for the network that you wish to connect to and enter the correct password to connect. \r\n\r\n Ensure that the phone is within range of the Wi-Fi network. If the phone is too far from the router, the signal will be too weak and the network connection will automatically disconnect. \r\n\r\n The maximum number of connected devices for the Wi-Fi network may have been reached. Try connecting to another available network. \r\n\r\n If your device is constantly trying to obtain an IP address when connecting to a Wi-Fi network, please follow the steps below to configure a static IP address: \r\n\r\n If the Wi-Fi network is password protected, go to Settings and select Wi-Fi to enter the Wi-Fi settings. Then select the network that you want to connect to. \r\n\r\n Select Show advanced options in the pop-up dialog box, select the pull-down menu in the IP settings area and select Static. Then enter the IP address and domain name and save your settings. \r\n\r\n Enter the password and then select Connect. \r\n\r\n If the Wi-Fi network is not password protected, go to Settings and select Wi-Fi to enter the Wi-Fi settings. Then touch and hold the network that you want to connect to. \r\n\r\n Select Modify network in the pop-up options menu. Select Show advanced options in the pop-up dialog box, select the pull-down menu in the IP settings area and select Static. Then enter the IP address and domain name and save your settings. \r\n\r\n The Wi-Fi icon will be displayed in the status bar after successfully connecting to the network. \r\n\r\n Check whether MAC address filtering was enabled on the wireless router. If the function is enabled, phones not in the access list cannot connect to the Wi-Fi network. Please refer to the wireless router instructions for a detailed description of the settings. \r\n\r\n Some public Wi-Fi hotspots may require you to log in on a web page in order to be able to connect. Please contact the Wi-Fi hotspot provider for details. \r\n\r\n If the problem persists, turn off the Wi-Fi function and then turn it back on or restart the Wi-Fi hotspot. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "3434",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1441098542000,
  "seriesProductName": "G610-U20,G630-U10,G760-L01,GRA-L03,GRA-L09,Holly-U19,Jazz-L09,Jazz-L11,Sophia-L10,Y220-U10,Y221-U22,Y360-U61,Y520-U22,Y600-U20,Y625-U32",
  "visitedTimes": 1,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "Wi-Fi, wireless network, Wi-Fi connection",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}