{
  "type": null,
  "faqId": 47750,
  "title": "My phone freezes",
  "answer": " Press and hold the power button to open the options menu and then select Restart. \r\n\r\n If you cannot open the options menu: for phones with removable batteries, please remove and then reinsert the battery; for phones with non-removable batteries, please press and hold the power button until the phone vibrates, in order to force a restart. \r\n\r\n If your phone freezes when using a third-party app, it could be because the app is not compatible with your phone. \r\n\r\n Please restart your phone, remove the third-party app and then install a similar app in its place. \r\n\r\n If after restarting, your phone continues to freeze, it is recommended that you back up any important data and then restore factory settings. \r\n\r\n If you are unable to use your phone when it freezes, please perform a forced update. After the update, the data in your phone's internal storage will be erased. \r\n\r\n Visit the [[<a name=\"_Hlt402513980\">Huawei Downloads Page</a>]()](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ) to search for and download a software update package for your model. Please refer to the update instructions contained in the package. \r\n\r\n If the problem persists, please contact Huawei customer service or take your phone and purchase invoice to a service center for inspection. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "3294",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1445479607000,
  "seriesProductName": "GRA-L03,Holly-U19,Jazz-L09,Jazz-L11,Y220-U00,Y330-U01,Y336-U02,Y360-U61,Y520-U22",
  "visitedTimes": 1,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "freeze, unresponsive, system crash, blank screen",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}