{
  "type": null,
  "faqId": 47905,
  "title": "How do I update my phone?",
  "answer": " ![](http://consumer.huawei.com/support/servlet/imageServlet?dlType=HtmlAreaImage&imageId=177123)\r\n\r\n In order to prevent user data, such as contacts, messages, and call logs, from being erased during updates, it is recommended that you back up data from your phone. \r\n\r\n Over-the-air update: Before performing an over-the-air update, please ensure that you have a mobile data or Wi-Fi connection. \r\n\r\n For EMUI 2.0 and EMUI 2.3, go to Settings, select Updates > System updates > Online update and then complete the update by following the on-screen prompts. \r\n\r\n For EMUI 3.0, go to Settings and select Updater > Check for updates. If updates are available, you can download and install them by following the on-screen prompts. \r\n\r\n Local update: Visit the [Huawei Downloads Page](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ) to download software update packages. Please refer to the package's update guide in order to complete the update. \r\n\r\n If your phone supports OTG, it is possible to perform an update by connecting an external storage device. \r\n\r\n Step 1 Use a USB OTG data cable to connect your phone to the USB storage device. \r\n\r\n Please use a Huawei-approved USB OTG data cable. These can be bought on Vmall or through a vendor. \r\n\r\n Step 1 Visit the [[Huawei Downloads Page]()](http://consumer.huawei.com/en/support/downloads/index.htm%22 \\o %22 ), download the software update package and then move the dload folder to the root directory of the USB storage device. \r\n\r\n Step 1 For EMUI 2.0 and EMUI 2.3, go to Settings, select Updates > System updates > Update via USB drive and then follow the on-screen prompts to complete the update. \r\n\r\n For EMUI 3.0, go to Settings and select Updater. Open the options menu, select Update via USB drive and then follow the on-screen prompts to complete the update. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "3449",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1445479652000,
  "seriesProductName": "GRA-L03,Holly-U19,Jazz-L09,Jazz-L11,Y220-U00,Y330-U01,Y336-U02,Y360-U61,Y520-U22",
  "visitedTimes": 10,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "upgrade, phone, flash",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}