{"type":null,"faqId":5459,"title":"Why I find an  unknown device  in the devicemanager after inserting the Data Card?","answer":"To solve the problem, do as follows:\nStep 1 When Standard Enhanced PCI to USB Host Controller in the device manager is disabled,\nthe data card should be identified correctly. If the data card cannot be identified, the problem\nmay be caused by static electricity. In this case, shut down the PC, remove all power cables\nthat are connected to the PC, and then wait five to ten minutes.\nStep 2 If another USB device is connected to the PC at the same time, remove all USB devices,\ndisconnect the E122 and then connect it again. If the E122 can be identified correctly, this\nproblem may be caused by the power failure of the main board. If the problem persists, go to\nStep 3 and Step 4.\nStep 3 Insert the E122 into other PCs to check whether the E122 can be identified correctly. If it can\nbe identified correctly, disconnect the E122 and then connect it again, or restart the PC. If it is\nstill identified as an unknown device in other PCs, contact the customer service personnel.\nStep 4 Insert another USB device to check whether it can be identified correctly. If the USB device is\nalso identified as an unknown device, the problem is caused by the hardware failure of the PC.\nIn this case, replace the USB jack or repair the main board. If the E122 can be identified\ncorrectly, contact the customer service personnel.","faqTypeId":null,"faqType":null,"useful":0,"unUseful":0,"languageId":1,"languageName":"en","faqCode":"5459","faqTypeCode":null,"isTop":"0","moduleCode":"faq","productId":null,"productCode":null,"postDate":1264835828000,"seriesProductName":"","visitedTimes":15,"isUsefulFlag":null,"score":0,"times":0,"imageList":null,"displayType":"text","justView":"0","fileName":null,"filePath":null,"imagePath":null,"imageName":null,"productIdList":null,"curPage":null,"pageSize":null,"siteCode":null,"statusFlag":"Publish","returnCode":0,"totalRows":null,"keywords":null,"avgScore":0.0,"createDate":null,"totalPages":null}