{
  "type": null,
  "faqId": 6338,
  "title": "How Can I Manually Upgrade the Software of My  Phone？",
  "answer": "Before upgrading the software of your phone, ensure that:  \r\n? The battery of your phone has been fully charged.  \r\n? The upgrade version is correct.  \r\n? Important information such as contacts, email messages, and files saved on your phone have been backed up.  \r\nTo manually upgrade the software of your phone, do the following:  \r\n1、Download the upgrade package from http://www.huaweidevice.com/worldwide/technicaIndex.do.  \r\n2、Use the unzipping software on your computer to decompress the upgrade package. Do not change the name and structure of the dload folder that is contained in the upgrade package.  \r\n3、Use a USB cable to connect your phone to your computer.  \r\n4、Copy the dload folder to the root directory of your microSD card.  \r\n5、Disable the USB mass storage feature of your phone.  \r\n6、Upgrade the software of your phone using the dload folder on your microSD Card.  \r\n      a. On the main menu screen, select Settings > SD card & phone storage > Software Upgrade > SD card Upgrade. Before upgrading the software, your phone automatically checks the battery level and the upgrade version. If the upgrade version you have downloaded does not meet the upgrade requirements, the phone will not start the upgrade.  \r\n      b. When a message is displayed, touch Confirm.  \r\n      c. On the displayed screen, touch Upgrade. Your phone automatically restarts and the upgrade screen is displayed. When the upgrade is complete, your phone automatically restarts.  \r\n      d. On the main menu screen, select Settings > About phone > Build number to view the software version of your phone.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 67,
  "unUseful": 24,
  "languageId": 1,
  "languageName": "en",
  "faqCode": "6338",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1321348771000,
  "seriesProductName": "",
  "visitedTimes": 3558,
  "isUsefulFlag": null,
  "score": 8,
  "times": 2,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 4.0,
  "createDate": null,
  "totalPages": null
}