{
  "type": null,
  "faqId": 32085,
  "title": "What can I do if my phone generates excessive heat?",
  "answer": "Whether your phone generates excessive heat depends on how you use your phone.\r\n\r\nl   If your phone generates excessive heat while charging: It is normal that smartphones generate heat while charging.\r\n\r\nYour phone provides overheat protection for the circuits, making sure the heat will not make the battery faulty or shorten its life span.\r\n\r\nCharge your phone in a cool and dry place.\r\n\r\nDo not surf the Internet, play games, watch videos, or use other power-intensive applications while your phone is charging.\r\n\r\nl   If your phone generates excessive heat while you are playing games: When you play games, your phone CPU runs at high speeds, which generates a lot of heat.\r\n\r\nHuawei phones all passed safety tests. Heat generated during normal use will not incur safety risks. It is recommended that you close background applications not in use while you are playing games. Do not play games while your phone is charging.\r\n\r\nl   If your phone generates excessive heat when you are using data services: How much heat your phone generates when you are using data services depends on the signal reception. If the reception is poor, your phone may generate excessive heat.\r\n\r\nIt is recommended that you move your phone to a place with good reception to use data services. Do not run too many networked applications simultaneously to avoid abrupt increase of data traffic and heat generated by your phone. Do not surf the Internet in places with poor reception.\r\n\r\nl   If your phone generates excessive heat during calls: Make calls in places with good reception. It is recommended that you use a headset for calls.\r\n\r\nHuawei releases updates at its official website from time to time. For better user experience, use the online update feature to update your phone.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 242,
  "languageName": "id",
  "faqCode": "6726",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1436245092000,
  "seriesProductName": "Jazz-L09,Jazz-L11",
  "visitedTimes": 3,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}