{
  "type": null,
  "faqId": 32098,
  "title": "What are the functions of my fingerprint?",
  "answer": "You can enroll 5 sets of fingerprints in normal mode and visitor mode respectively, and open applications using those fingerprints. For example, instead of entering password, you can use your fingerprint to turn off your screen, unlock your screen, log in to your cloud account, unlock your applications, and access your file safe.\r\n\r\nYou can set all these functions on **Fingerprint ID** screen.\r\n\r\nCreate a fingerprint and enroll it to your fingerprint list.\r\n\r\nThe fingerprint sensor can be used as a touch-sensitive button. In camera, press and hold the sensor for one second to take a photo. This function is especially convenient for taking selfies.\r\n\r\n1.         Application lock\r\n\r\nIf you don't want others to open some applications on your phone, such as WeChat, use the fingerprint function to lock them. These applications can only be unlocked when you enter your own fingerprint.\r\n\r\nGo to **Settings** > **Fingerprint ID**, and enable the application lock function.\r\n\r\nGo to **Phone Manager** > **App lock**, and set the app lock password and choose applications you want to lock.\r\n\r\n2.         Huawei cloud service\r\n\r\nUse your fingerprint for account identification in important data operations. For example, use your fingerprint to find your phone.\r\n\r\nUse your fingerprint to change the security information settings of your account, or log out from your account.\r\n\r\nUse your fingerprint to pay for online purchases.\r\n\r\n3.         **Safe**\r\n\r\nYou can store your financial and other private files in the safe and lock the safe using your fingerprint.\r\n\r\nGo to **Settings** > **Fingerprint ID**, and turn on **Access safe**.\r\n\r\nGo to **File manager** > **Categories** > **Safe**, set the safe password, and choose files to be protected.\r\n\r\n4.         **Visitor mode and normal mode**\r\n\r\nYour phone supports visitor mode and normal mode. In visitor mode, your private information is blocked.\r\n\r\nPress your right finger against the sensor to enter normal mode and press your left finger to enter visitor mode. For example, when your child is playing with your phone, set your phone to visitor mode.\r\n\r\nGo to **Settings** > **Fingerprint ID**, and set your PIN or password and enroll your fingerprint.\r\n\r\nGo to **Settings** > **Security** > **Privacy protection**, enter the PIN or password, and the fingerprint to unlock the screen will be displayed.\r\n\r\nTouch **Let's start**, and enter the visitor password to enter visitor mode. You can select a fingerprint from the owner fingerprints or create one to enter visitor mode.\r\n\r\nThen you can select the content you want to keep private in visitor mode. Or go to **Settings** > **Security** > **Privacy protection** > **Manage fingerprint**, and view the owner fingerprint and visitor fingerprint.\r\n\r\nWhen your screen is off or locked, enter visitor mode or owner mode using corresponding fingerprint.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 242,
  "languageName": "id",
  "faqCode": "6741",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1436246875000,
  "seriesProductName": "Jazz-L09,Jazz-L11",
  "visitedTimes": 15,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}