{
  "type": null,
  "faqId": 22510,
  "title": "P7 Pil ile ilgili önemli bilgiler",
  "answer": "l      Şarj edilebilir pillerin kullanım ömrü kısıtlıdır ve belirli bir süre sonra yenilenmeleri gerekeblir. Pil ömründe gözle görülür bir azalma olduğu takdirde pili değiştirin. Telefonunuzun pili kolayca çıkarılabilecek şekilde üretilmemiştir. Pili çıkarmak için bir yetkili servisle iletişime geçin. Pili kendiniz çıkarmaya kesinlikle çalışmayın.\r\n\r\nl      Telefonunuz uzun süredir özellikle sıcak bir ortamda çalışmaktaysa, sıcaklık telefonun dış yüzeyinde hissedilebilir. Telefonunuzun aşırı ısındığı durumlarda kullanmayı derhal bırakıp bağlı bütün güç ünitelerini sökün ve soğumaya bırakın. Yanık yaralarından korunmak için telefonu uzun süre elinizde tutmayın.\r\n\r\nl       Telefonunuzu şarj etmek için orijinal pil, güç adaptörü ve USB kablosunu kullanın.\r\n\r\nOrijinal aksesuarları kullanmadığınız takdirde telefonunuzun performansında düşme olabilir ve güvenlik problemleri doğaabilir. Telefonunuz şarj olurken herhangi bir işlem yapmayın ve herhangi bir koruyucu ile örtmeyin. Aynı şekilde güçadaptörünüde örtmeyin.\r\n\r\nl       Pilin tamamen şarj olma süresi ortam sıcaklığına ve pilin yaşına bağlıdır.\r\n\r\nl      Telefonunuzun şarj seviyesi düşükse, pilin düşük olduğuna dair bir alarm çalınır ve ekranda bildirim gösterilir. Pil seviyesi kritik düzeyde düşükse telefonunuz otomatik olarak kapanır.\r\n\r\nl      Telefonunuzun şarjı tamamen bitmişse, prize taktığınız anda hemen şarj etmeye başlamayabilir. Bu normal bir durumdur. Bu durumda telefonunuzu şarja taktıktan sonra açmak için birkaçdakika bekleyin.",
  "faqTypeId": 793,
  "faqType": "Pil ve Şarj",
  "useful": 28,
  "unUseful": 28,
  "languageId": 181,
  "languageName": "tr",
  "faqCode": "6390",
  "faqTypeCode": "Battery and Charging",
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1428652287000,
  "seriesProductName": "Sophia-L10",
  "visitedTimes": 2188,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}