{
  "type": null,
  "faqId": 47565,
  "title": "手机发热怎么办？",
  "answer": "**上网发热****：**\r\n\r\n1. 手机自带浏览器功耗经过优化，建议优选自带浏览器上网，减少发热。\r\n\r\n2.使用第三方浏览器时，可以在浏览器里设置无图模式等减少发热。\r\n\r\n3. 上网时需在状态栏显示信号强度满格的情况下使用，以减少发热\r\n\r\n**游戏发热**\r\n\r\n游戏耗电量大，比打电话，看视频，听音乐发热量大是正常的现象，建议您不要一边充电一边玩游戏。另外，游戏的时候您可以通过清除后台应用程序、将媒体音量调节到中等以下的方法减少发热、提升续航。\r\n\r\n**拍照摄像发热**\r\n\r\n拍照摄像场景功耗较大，气温高时发热属于正常现象。华为手机使用了独立单反级图像处理器、光学防抖镜头和RGBW感光元件，这些部件使成像质量和拍照速度大幅提升，也会增加一定功耗，导致夏天拍照或摄像容易发热。如果感到发热，请适当减少连续使用相机功能的时间，缓解发热。\r\n\r\n**看视频时发热**\r\n\r\n市面上视频播放器因解码方式不同，耗电差异较大，建议选择功耗较低的硬件解码。手机自带的图库与播放器经过充分的优化，耗电/发热更低，建议您优先选择，同时推荐您可以选择搜狐视频播放器（播放时选择高级播放器）。另外，充电的时候尽量避免长期看视频。\r\n\r\n**使用微信发热**\r\n\r\n1. 微信需要频繁联网获取最新消息，会导致手机在夏季轻微发热。\r\n\r\n2.微信朋友圈视频需要下载很多数据，频繁联网，浏览大量朋友圈视频，手机出现发热是正常现象。在网络信号较差时，发热会增加。\r\n\r\n3.微信视频通话发热是因为该功能功耗很大，相当于摄像+上传下载同时进行。我们已经在和微信一起优化，请及时升级系统，获取最新优化措施。\r\n\r\n**使用视频通话发热**\r\n\r\n视频通话发热是因为该功能功耗很大，相当于摄像+上传下载同时进行。我们已经在和腾讯一起优化，请及时将系统软件升级到最新版本，内含最新优化措施。\r\n\r\n**打电话时发热**\r\n\r\n信号质量较差的时候发热量会急剧增大。本手机在通话发热控制方面已经做到业界领先水平，您可以放心使用，如果您感觉到通话时手机发热较明显，建议您关注信号质量情况，或注意手机是否点亮屏幕。另外，建议您在通话的过程中尽量避免点亮屏幕，不要一边充电一边打电话，这样可以减少手机额外的发热。\r\n\r\n**导航发热**\r\n\r\n导航软件功耗较大，容易出现发热现象。如果手机没有下载离线地图，导航时会不断下载地图数据，发热增加；信号较差或不稳定时射频发射功率增加，也会增加发热。一般车内温度较高，不要将手机放在温度高/阳光直射/保温好的地方。导航时充电发热会比平时增加，发热是正常现象。\r\n\r\n**炒股软件发热**\r\n\r\n炒股软件需要实时联网、刷新数据，功耗较大，在夏季等气温较高时容易出现发热现象。可以采取以下措施降低手机发热：\r\n\r\n查看完股票数据后请清理手机后台软件，降低待机功耗。\r\n\r\n在设置-受保护的后台应用，取消股票软件的受保护；\r\n\r\n在设置-省电管理，设置超长待机模式。\r\n\r\n**听音乐时发热**\r\n\r\n全高清手机在亮屏、大音量听音乐的时候手感稍热，在天气较热的时候比较明显，这些是业界普遍现象，手机本身并无质量问题，您可以放心使用。本手机对音乐播放音质进行了提升，发热也会略有增加，如感到发热，请将音量降至一半即可。另外，手机发热时，请尽量避免同时在听音乐的时候玩游戏、操作手机进行其他业务。\r\n\r\n**手机充电发热**\r\n\r\n夏季气温高，手机充电时下部发热是正常现象。建议在充电的时候避免长期使用手机。\r\n\r\n请不要充电时将手机放在床上或保温性能好的环境中，充电的热量无法散开会导致温度增加。充电时手机要放在桌面等散热良好的地方。\r\n\r\n**其他发热**\r\n\r\n由于性能提高，智能手机发热是普遍现象，尤其在游戏、视频通话、拍照、摄像等运算量大的场景。同时，在信号较差的地方通话或上网，由于要增大发射功率保持通信，手机也会有发热现象，这是正常的。\r\n\r\n**改善发热的建议**\r\n\r\n1：选择合适的亮度声音设置。调整屏幕亮度：亮度太高耗电快且刺眼，容易导致屏幕下部发热，建议设置一半亮度条+自动调整亮度；设置方法：设置 – 显示 – 亮度，调整亮度进度条到中间位置，勾选自动调整，或者在通知栏下拉菜单最下面也有亮度进度条的控制。\r\n\r\n多媒体声音设置过高会导致手机耗电快且后壳下部容易发热。建议设置多媒体音量为一半或以下，大音量不要长时间使用。\r\n\r\n2：选择合理的省电策略\r\n\r\n进入“设置 – 省电管理”选择省电模式。改善发热和续航，建议您选择“超长待机”，在电池电量较少的时候选择“超级省电”；\r\n\r\n3：闲时关闭GPS减少耗电：\r\n\r\n闲时关闭GPS：不用导航定位时，关闭GPS功能。很多第三方应用会发起定位您当前位的请求，当在室内没有GPS信号时，频繁地发起GPS定位会明显增加手机功耗。状态栏下划->开关->选择关闭GPS。\r\n\r\n4：减少同时运行的应用：安卓系统支持多应用同时进行，后台开启多个软件时，会增加手机耗电和发热。请减少运行的应用数量，关闭不必要的应用。\r\n\r\n随手清理后台应用：清除使用过程中的后台应用方法：点击右下角的导航栏第三个图标，显示最近运行的应用，手指向上滑动可以清除一些不必要的后台应用或清除所有。\r\n\r\n减少受保护的后台应用： 设置->受保护的后台应用，保留QQ微信外的其他非必要受保护程序，防止其在后台增加耗电。\r\n\r\n发现高耗电的应用：查看软件耗电排行：设置 – 省电管理 - 后台耗电应用，查看耗电的较多的应用；如耗电较多的应用并非您经常使用的，建议结束该应用或卸载掉。手机监测到耗电高的后台应用时，会弹出提示信息，点击将看到耗电应用，建议及时结束不需要的应用以省电。",
  "faqTypeId": 133,
  "faqType": "电池与充电",
  "useful": 0,
  "unUseful": 0,
  "languageId": 2,
  "languageName": "zh_cn",
  "faqCode": "zh-cn_topic_0019249764",
  "faqTypeCode": "Handsets-Battery-Charging",
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1445302183000,
  "seriesProductName": "P6 S-U00",
  "visitedTimes": 139,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "电池与充电",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}