{
  "type": null,
  "faqId": 8615,
  "title": "Что делать, если телефон перегревается?",
  "answer": " В зависимости от того, как Вы используете телефон, он может перегреваться.   \r\n\r\n Телефон перегревается во время зарядки: смартфоны могут перегреваться во время зарядки. Это нормально.   \r\n\r\n В Вашем телефоне установлена теплозащита микросхем, что обеспечивает защиту от сбоев в работе батареи и от сокращения срока ее службы. \r\n\r\n  Заряжайте Ваш телефон в прохладном и сухом месте.   \r\n\r\n Не используйте Интернет, не играйте в игры, не просматривайте видео и не используйте энергоемкие приложения во время зарядки телефона. \r\n\r\n Телефон перегревается во время игры: во время игры процессор Вашего телефона работает на высоких скоростях, что приводит к образованию большого количества тепла. Все телефоны компании Huawei проходят испытания на надежность и безопасность. Тепло, образованное во время нормального использования телефона, не приведет к сбоям в его работе.   \r\n\r\n Рекомендуется закрывать неиспользуемые приложения, работающие в фоновом режиме, во время игр. Не играйте во время зарядки телефона.   \r\n\r\n Телефон перегревается во время передачи данных: количества тепла, образуемое Вашим телефоном во время передачи данных, зависит от уровня приема сигнала. Если сигнал слабый, телефон может перегреваться. \r\n\r\n Рекомендуется перенести телефон в зону с устойчивым сигналом при использовании службы передачи данных. Во избежание резкого повышения трафика данных и перегрева телефона, не запускайте одновременно слишком много сетевых приложений. Не используйте Интернет в зонах со слабым сигналом.   \r\n\r\n Телефон перегревается во время вызовов: выполняйте вызовы в зонах с устойчивым сигналом. Для выполнения вызовов рекомендуется использовать гарнитуру.",
  "faqTypeId": null,
  "faqType": null,
  "useful": 18,
  "unUseful": 13,
  "languageId": 21,
  "languageName": "ru",
  "faqCode": "9116",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1394704384000,
  "seriesProductName": "",
  "visitedTimes": 1592,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": null,
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}