{
  "type": null,
  "faqId": 41735,
  "title": "Why does the fingerprint unlock feature frequently fail to work properly?",
  "answer": " The fingerprint sensor on Huawei phones is designed to work at temperatures ranging from –20ºC to +75ºC. If the fingerprint sensor fails to recognize your fingerprint, this is usually due to the ambient conditions. \r\n\r\n This problem is normally observed during cold periods when the finger's skin is susceptible to peeling, causing temporary changes in the shape of your fingerprint. In addition, the fingerprint sensor may also not work properly late at night or when you wake up in the morning due to changes in the depth of fingerprint ridges caused by dry fingers and slow circulation. \r\n\r\n 1. Check whether the skin on your finger is dry, peeling or damaged. The fingerprint sensor is designed to work at temperatures ranging from –20ºC to +75ºC. \r\n\r\n Solutions: \r\n\r\n  Use another finger. \r\n\r\n  Use skincare products to keep your skin moist and prevent it from peeling or cracking. \r\n\r\n  Use warm water to wash your hands. \r\n\r\n  If your fingerprints are not clear, exercising or using warm water to wash your hands can help to relieve the problem. \r\n\r\n 2. Check whether the surface of the fingerprint sensor is dirty and clean it if necessary. \r\n\r\n 3. If the fingerprint sensor is still not working properly, check whether your phone vibrates when you use the sensor. If so, this means that your phone did not recognize your fingerprint and the screen was not unlocked. \r\n\r\n Solutions: \r\n\r\n Try to cover the whole of the fingerprint sensor with your fingertip. \r\n\r\n You can record six images for each fingerprint: two for the center of each finger (the most commonly used part) and four for the surrounding areas. The greater the surface area you record, the greater the accuracy of the fingerprint sensor. Try registering your fingerprint again following the preceding steps. When registering your fingerprint, avoid using the same area of your finger for all the six images. \r\n\n\n\n\n",
  "faqTypeId": null,
  "faqType": null,
  "useful": 0,
  "unUseful": 0,
  "languageId": 244,
  "languageName": "mm",
  "faqCode": "7195",
  "faqTypeCode": null,
  "isTop": "0",
  "moduleCode": "faq",
  "productId": null,
  "productCode": null,
  "postDate": 1442207750000,
  "seriesProductName": "RIO-L01",
  "visitedTimes": 1,
  "isUsefulFlag": null,
  "score": 0,
  "times": 0,
  "imageList": null,
  "displayType": "text",
  "justView": "0",
  "fileName": null,
  "filePath": null,
  "imagePath": null,
  "imageName": null,
  "productIdList": null,
  "curPage": null,
  "pageSize": null,
  "siteCode": null,
  "statusFlag": "Publish",
  "returnCode": 0,
  "totalRows": null,
  "keywords": "RIO-L01, G7 plus",
  "avgScore": 0.0,
  "createDate": null,
  "totalPages": null
}